As a PhD student, I spend a lot of time in the library and I need a light computer like this to carry with me while I look through books.  This is perfect--since it's barely two pounds, you often forget that it's there.  With the LitePad, my (now) hand-written notes, papers, and articles are easily within reach whenever I need them; there's no more wishing I had brought more papers with me from home and the like.  My Palm used to fulfill a similar function, but I've stopped carrying it now that I have this.  I was especially surprised by how accurate the note-to-text feature is: even though it's not perfect, it's still many times better than what we had before.  With my handwriting at least, it has about a 90% accuracy rate (usually the words it misses are words in other languages, etc).  This machine has changed my life for the better, and I whole-heartedly recommend it to anyone else in academia.
This is the perfect product for any psychotherapist.  Taking notes on this is so much better than using a pad.  All of each patient's sessions are in one place.  Easy to download to my zip drive.  I highly recommend it to any therapist out there.  The only drawbacks to this model are the battery life and the need to get every available Windows Update since the software that comes with the tablet is not current.  If your chair is near an outlet, then you are really set to go.
Pros: fast CPU, very configurable build options, convertible style means you can go "laptop" if you need to get serious data entry accomplished, built-in Ethernet and WiFi, SD card slot.Cons: price is real hefty, lacks some high-end options like fast-big HDD, no Firewire.This tablet is really the only true competitor to Fujitsu's long-time reign as tablet leader.  It has a rich feature set, brilliant LCD display, and the processor power to exceed Fujitsu's latest offerings.  Of course, the true utility in a tablet is the software, and Windows XP Tablet PC edition more than handles the job of capturing pen taps, clicks, and sketches (handwriting, lettering, or drawings).As a portable PC, however, it is an extremely pricey solution.  The largest hard drive is 80Gb -- for a laptop that is about the max -- but the rotational speed is 5400 RPM.  No doubt this saves power and generates less heat, but the speed hit is significant.Also significant is the cost of RAM upgrades for the unit.  Two sticks of 1Gb RAM will set you back another $1700 over the sticker.Getting past the price premiums, though, it's easy to see that the M200 can be a replacement PC with a decent docking station.  You'll miss the Firewire connectivity, but the USB 2.0 ports are available and it does comes with an SD card reader in the unit itself.  Nice.With the WiFi radio, built-in Ethernet, and built-in modem, there's really no reason why you can't connect on the road.  You can opt for the 802.11b or 802.11g radio, but opt for the 11g and get the 54Mps instead.I was a big fan of the Portege 3505 series from Toshiba, and this tablet marks a nice upgrade from that series.  Adding WiFi, SD card reader, faster processor, and more RAM options makes this the tablet if you need one... and have the bucks for it.Fred
I got my M200 several months ago and am very satisfied with it.However, I use it less than I had anticipated, so I only gave it 4 stars.Common Tablet Features - neat, but not much used.I enjoy taking notes in different colored pens, with the ability to erase notes written in "pen" and to add space between lines already written.  I use the Journal and the pen  for to-do items or short lists. For longer documents, I prefer to type.  While suring the web, I find it inconvenient to have to open the input panel to write the web address, and then to look for and peck the "enter" or "go" button. I have used a pocket-pc for a number of years and often attempt to use the same input shortcuts on the laptop which do not work.  I get confused between the pen input shortcuts on the tablet and the pocket-pc. I really love many of the "power toys" games that were offered free by Microsoft. I use my pen to play these games. So far, I do not use OneNote much.  It forces me to use a different methophore to organize my files (from many folders to a single, very large, binder).  This is really inconvenient for me because I have a lot of folders and subfolders already organized. I have reorganized one small project into a binder, but I don't think I will be transfering over more files into the OneNote format. I most often use the pen as a pointing device with full access to the keyboard in the "laptop" mode.  I find the pen easier when I am moving a lot of files around (especially in FrontPage).I have a fully configured desktop 2 Ghz machine at home with 17" LCD monitor and real keyboard.  The M200 is great, but does not match user-interface with a full desktop.  I do use it more at the office.Machine specific review:The screen has a bad glare in "tablet" mode when I am at my office where ceiling lights are directly over my desk.  Glare is not an issue at home where a table lamp sits next to the laptop.  All the colors seem to be washed out when I get a bad glare.  The screen is wonderful with a very high resolution when there is no glare. The pen feels silky smooth when it glides on the screen.  Keyboard is excellent!  Love the cushy bubble-like feel.  Audio recording is amazing.  It has noise-cancelling through 3 tiny microphones build into the screen bezel. Music sounds very good through plug-in headphones. Built-in speaker (mono) is loud and good enough for hearing recorded conversations.  It has a very extensive set of ports including an SD card slot.  It is very fast, even with modest memory (I have the Dolthan version).  Ethernet connection is fast (have not tries wireless yet).  Battery seems to last about 4 hours of continuous light use. Overall, it feels solidly and well built.  The hard disk made annoying, continuous, clicking sounds when I first got it.  But after I turned some processes off and twicked power save options (and windows has optimized itself) I don't hear the clickings as often.  I thought not having a CD/DVD drive might be a pain, but I found it to be easy to set up another desktop with a CD/DVD drive to share it on the network. I thought the 4.5 lbs weight might be too heavy but I find it to be not too bad.  I am glad I bought a hybrid instead of a slate model, since I am not using the pen very much.  Setting aside the tablet features, the M200 is a very well made high performance laptop with an amazing screen (in the right viewing angle).  But if I were to exclude the tablet features, I could have gotten a 2.4 lb laptop (Toshiba R100) or a 3 lb laptop with a built-in CD/DVD drive (Panasonic W2). So, I gave it only 4 stars, but I still think I made the right choice.  I may learn to use more of the tablet features in the future as I grow more proficient at it, and I use it occassionally now.
This thing is amazing. Since I got it a month ago I no longer touch either of my desktops and I nearly stopped using paper (I mean, to write on!). Superb 1400x1050 resolution exceeds anything you find useable on a desktop monitor. The tablet mode is great, too, with high resolution, intuitive interface and a comfortable pen. I write equations a lot, which is basically impossible with just a keyboard and a mouse, so the tablet mode is very handy. Handwriting recognition is very good, not that it matters, since most people type faster than they write, anyway. Speach recognition is also built in, but I never bothered to train it properly, and it's useless without training. Microphone and (monoaural)speaker are good enough for Skype and MSN Messenger, but not for watching DVD movies. Which is a moot point since there is no built-in optical drive of any kind. Had to buy an external USB 2.0 DVD-RW. No Firewire port, either. Can't have everything. Not yet anyway. Battery life is good, about 4 hours in the long-life mode, enough for most domestic flights, if you hate the inflight movies. The wow factor is fun, too, no question, especially when I take handwritten notes on it.I wish this tablet was thinner, as it's hard to write on a surface a full inch above the table level, so I either prop its far side with something, or simply keep it on my laps. It gets a bit hot at full power, but quite nice in the long-life mode. Built-in wireless networking is 802.11b, not .g, which is good enough for now.As this technology matures (thinner, slide-out keyboard, more tablet-friendly apps etc.) it will likely displace both regular laptops and pure tablets, since the price difference is not that high.
I wrote "Absolute Beginner's Guide to Tablet PCs". I reviewed lots of different Tablet PCs, and this is the one I use. It has the highest-resolution screen, good disk space, zippy performance, and lots of extra features.If you want the fastest Tablet PC with lots of screen real estate and portability, the M200 is the one for you. I had a Toshiba Portege 3500 before this one, and the M200 is definitely a step up.I have purchased ten Toshiba Tablet PCs for my company, and none of them have broken. The M200 is a more stable machine than the Portege 3500,though.Great job, Toshiba!
Hil am writing this via the tablet pc by writing with the pen.This tablet pc is one of the fastest tablet pcs out there - and it has the best graphics card compared to all the other Tablet pcs.Using a tablet pc helps you in taking notes, (you can search for handwritten notes)  replace your notebook entirely, change your notes to text.The tablet pc is small (A4-screen)so it is very mobile.
I love mine! it works great my only problem is that it has to have an external cd drive, otherwise it is amazing.  As a student ai use it to take notes which i can later convert into text, to make nice, neat, and readable notes.
Toshiba is the worst! The computer broke down the first week I got it, and all Toshiba assistance could do in FOUR months from them is to tell me to bring it to THREE different places to get it repaired!!!
