What do you want from your phone?I'm a bit of a gadget geek, so I wanted it all.  I wanted text messaging, a large color screen, web access, AOL AIM access, Java-based games, you name it.  So, I was willing to shell out the big bucks when it came to getting a phone.I got the i95cl about a year ago, and I've been very satisfied with the phone's performance.  I'm not as satisfied with Nextel, though, who you have to get service from to get this phone.  All the features you could ever want are there, but you're going to pay for them.  Web access costs money, text messaging costs money, caller ID costs money...  they nickle and dime you for all the features on their network.  They have package deals, which is what I use, where it's $15 a month for all their internet access features, which makes it reasonably affordable, but if you're looking for a cheap phone and a cheap monthly bill, you won't get it with this phone, and with Nextel.Now, back to the phone.  Here are the pros:- Pretty good battery life (I charge every 2 to 3 days).- Very sturdy design, unlike several phones I've owned before.  The antenna is tough, and so is the case.  Dropping it won't break it.- Loud and clear sound, and a built in speakerphone.- Color screen, which is nice for looking at web sites, or playing the Java games...  which leads us to...- Built in Java engine which allows you to download applications from Nextel right onto the phone.  Games, business applications, notepads, there are lots of fun java tools to play with.  Some are free, and some you have to pay for.- Nextel Direct Connect, which you can only use to talk to other Nextel customers, but the phone functions as a walkie-talkie, and it's very convenient.- Internet access, allowing you to text message, instant message, receive emails, and browse the web (text only).- Voice activated dialing, which is convenient.- Amazing coverage.  I have service inside buildings when no one else does.  The antenna picks up signals well, and Nextel has great coverage.This is all well and good, you say, but what are the drawbacks?  There are a few cons to this phone:- Size.  Man, is this a big phone.  I have a holster on my belt, it really isn't "pocket sized".  To get a nice big screen, and durability, you have to sacrifice size.- Cost.  As I said before, the phone is expensive, and so are all the cool little extras.  You probably will be paying $50/mo for this phone.- Web access is text only, which is unfortunate, as some new phones are entering the market with real graphical web browsing.So, like I said at the beginning of this review, what do you want from your phone?  If you're willing to pay for it, this phone has it all.  It's a little big, and a little costy, but I've been in love with it for a year now, and I don't think I'll be trading phones any time soon.
I do not like the phone because it only holds a charge for about 12 hours...If you use it it holds it for less time.  I ordered two of these and it happens with both.  I also tried replacing the phone and it happened with the new one as well.  The second problem occured when I signed up with Amazon for Nextel service. I was told by Nextel that I would not have a specific length of time I would have to keep my service.  They said this was special for Amazon customers...However when I tried to cancel the service I was told I had to stay in a contract for one year.  I NEVER signed or agreed to a contract however I am told I am being held to one.  I have been going around in circles with these two companies and nobody can get their act together...Love Nextel service but not when you use Amazon to get it...Try another plan or go directly through Nextel.
Wow!  What a spectacular phone!  From clarity of the screen to clarity of the calls, this service beats all other cell phone providers by a mile.  I have never had a cell phone that I can use in elevators before, or in basements, or in the middle of the woods- but this one works in all those places (and for all those who complain about it not working in your house sometimes, move out of the boondocks- all cell services have a few black holes)!  Not only is the cell phone service great, but the walkie talkie feature is creative, convenient and useful.  Some complain about the larger phone styles- but the ruggedness of the phones are so worth it (I have dropped mine a million times and it has never even flinched at working).  I will never have another cell phone service! Now you can even keep your cell phone number when you switch to Nextel!
I've owned this phone for several months now, and I really have no complaints. I know there are camera phones out there, and phones with better graphics that are thinner, but none of them have the great service that Nextel offers. I've tried all the major providers that are available here and they just don't compare. There are so many ways you can personalize this phone. But one of the relatively few drawbacks is that you can't assign a ringtone to certain people. Although you can with the new phones that just came out. But overall, this is a great phone with many features and you can add ringtones, wallpapers, java programs... I would have given it 5 stars, but it is a bit bulky, and you are limited compared to the newer phones out there. But you really can't go wrong with the i95cl.
The phone is great.  I would recommend it to families especially.  The only problem is that the surface scratches easily.  An excellent phone nonetheless, wonderful service.
The i95cl brings phones to a new level. It has so many ways to personalize the phone for yourself. It is ideal for people who want a serious phone that is very productive and avoids the frills of other phones. I have used many phones and this one has the best reception hands down. There is plenty of room for Java-apps and ringtones to personalize the phone. It is a little larger then alot of cell phones, but not unbearable. Compare it to buying a different phone and a different walkie-talkie and then carry both of those in your pocket. Overall, great phone...there is plenty to keep you intereted as you personalize the phone for yourself.
This phone is remarkable! I found a website where you can download ringtones, games, and wallpapers! howardforums.com if you want them. Well anyway this phone is amazing with the amazing color and the awesome sounds of the ringtones. I recommend this phone to anyone!!!!!!
the only compaint i have have about this phone its to large does not fit in your shirt pocket nexel service cannot beat forget all the others believe me AT&t, t mobel, sprint nextel is the best. battery life not great display great munu all other features a good
This phone is really easy to use.  Like listed above, it is simple with not alot of features.  It is my second LG phone and I am happy with it so far.  The sound is good quality (loud enough), signal strength is good, buttons are slightly larger than on the LG TM-510, small and compact phone, very lightweight, silver finish makes it look very professional, might not have along of ringtones to choose from but it gets the job done.The only drawback on it is features.  If you are looking to be able to send text messages, have various ringers, large screen (meaning the size of the font on the screen), and a very well featured phone-then, as stated before, this phone is not for you.  If you are looking for a good phone that will serve your basic operations of simply sending and receiving phonecalls, then this phone is what you want.
I bought this phone to replace a Sanyo that was stolen.  Within a few months, I had to get a replacement since the display screen on the outside (the little box) had gone dead.  Within a few more weeks, the second phone's display died, and I've just left it blank, as it was too much trouble to replace - Sprint's customer service is poor.I find the sound quality, key size, and overall features to be acceptable but not great, and wish I had bought a Sanyo again.  With Sprint, you are fairly limited to phone choice - I'd recommend against LG if you are looking at several models/brands.
I have owed the 8100 for about four months.- The main lcd screen:This screen is very bright.  During a recent power outage, I used it to find my way around my house.- The call clarity:I used to make jokes about the poor reception I got with my Nokia 6185.  With this phone, it sounds more like a land line than a cell phone.  The first time my brother called my mom with the 8100, she could immediately tell that he had a new phone.  The earpiece volume is adjustable, and can get very loud (almost sounds like a speakerphone).- The camera:Ok, so the image quality is low.  But the features are impressive.  You can assign images as caller id's for people in your phone book.  You can email a picture to anyone immediately after taking it.  I don't carry any family pictures with me.  If I want to show pictures of my nephews and nieces, I can just pull out my phone.  It even has a self-timer, so you can set your phone down and get in the picture.- The Calendar:I use this feature every day.  You can set reminders (like: "take out trash") to repeat weekly, monthly, or annually.  You can be alerted of events minutes or hours in advance.  You can even assign a specific ringer as the alarm for an event.- Ringers:This phone supports polyphonic ringers, which are like normal ringers- except more "vibrant."  It also supports ".QCP" ringers (which are actual sound clips) containing songs or voice.  You can assign different ringers for individuals in your phone book.- Games:The games aren't "gameboy" quality, but they do come close to those little pocket lcd games.  Using the keys on the phone as controls feels a bit wierd.  Some games use the phone's vibrator as a "rumble"feature.  The selection of games available is adequate.- Applications:This phone supports some applications.  I have installed and used a stop watch, an instant messaging app, the RealOne player (subscription service), and a to-do list app.  I have yet to see any "full-motion" video displayed on this phone.- Email:After you sign up, Sprint gives you an email address that's attatched to your phone.  You can send and receive text emails using that address (from your phone or their website).- Misinformation:When the documentation says it has "screensavers," that's not true.  What they mean is that the phone uses images kind of like the desktop wallpaper on your pc.  When the phone is not in use, the screen turns off automatically.  When the documentation says "wireless internet," that is misleading.  You can only view small html pages or specially designed "wml" or "wap compatible" pages.  You can't view the amazon site the way it looks right now on your computer screen.- Ways to use it:This phone works even better when combined with some other services.>Textamerica provides free "moblogs.">Qualcomm "Purevoice converter" lets you turn your mp3 files intoringers.>Sites like 3GUpload let you upload images and ringers from your pc to your phone (for a small fee).>Wireless internet sites like Mapquest and Hollywood give you driving directions, movie times, and more using your phone's browser.This is a great phone.  You'll have loads of fun with it, even if no one ever calls you.
The Sprint PCS 8100 is a terrific camera phone.  It's the second camera phone to be sold here stateside.  Size-wise, it could be a bit thinner like the Panasonic GU-87 GSM phone for AT&T; Wireless; but, to be fair, the 8100 is already quite compact, and much smaller than the very first camera phone to hit the U.S. market: the venerable Sanyo SCP-5300.Compard to the 5300 (which is still being sold by Sprint), this 8100 phone has a very bright main LCD, albeit slightly smaller (1.8" vs. 5300's 2.1").  Its 56k color range is very good, and did I mention it's super-bright?  Definitely the brightest and clearest phone LCD screen I've seen so far -- and I've personally checked out lots of phones on sale in the U.S. and also in Europe.  BTW, an interesting thing about the 8100's screen is that, even if you turn off the backlight, the main LCD is actually still backlighted (backlit?) at a lower level. So for the 8100, backlight on means very bright backlight, and backlight off means dim backlight.  The main LCD supposedly uses some new technology developed by Sanyo that draws less power than other LCD screens even when it's backlit.  (I read this on some geek website.)  The external sub-LCD (on the flip cover) is squarish and also capable of 56k colors, but at 96x96 its resolution is quite low.  One interesting use of the external sub-LCD (other than displaying picture caller IDs) is to use it for taking self-portraits.  Since I'm an unapologetic narcissist, I simply adore this feature! :)As a cell phone the 8100 shines, no pun intended.  The reception is just exceptional!  If you've read my other phone reviews you'd know I live in a basement apartment here in the outskirts of New York City.  The 5150 and 5300 I had owned before used to get 2-3 bars on the signal strength indicator, but the 8100 regularly gives me 4 bars!  I'd say 3-4 is my normal strength, occasionally it drops to 2, and very rarely it goes to 0-1.  The built-in earpiece has good voice quality, and it's definitely the loudest earpiece of all Sanyo phones sold s far -- and better than other Sprint PCS offerings.  Close to 20 high-quality ringers are included, ranging from simple ringing tones to melodies; they are pretty loud at the highest setting, although a perfectionist such as myself always thinks we can use a bit more volume.The phone functions are easily laid out and responsive.  The user interface is clean and simple.  You don't need to read the user's guide to figure most things out, as the phone uses a pop-up menu system extensively.  One nice touch is the "Mi Amigo" animated character.  I won't tell you what it is, though, as you have to see the fun little thing yourself.  (Hint: it bathes, exercises, sleeps, beams down from Mars, etc.)Of course, the main draw of this phone is its built-in camera.  Compared to the older 5300, this one's resolution is a step down, something like 172x220, vs. the 5300's true VGA (640x480) resolution.  The 8100 also doesn't have a built-in flash like the 5300, and you cannot do special digital effects (e.g., digital zooming) as on the 5300.  The picture quality is also lower than on the 5300.On the other hand, you get two distinctive pluses vs. the 5300: 1) it takes surprisingly decent pictures in low light, so party photos should come out ok -- in fact I've seen a lot of users take party pics using their 8100s and many would come out surprisingly well, 2) it's much easier to organize and share (or upload) picture files on the 8100 than on the older 5300, and you can also store more pictures due to the smaller size.  With each picture, you can upload to Sprint's free picture-sharing website, or you can save to the "picture wallet" folder, from where you can assign them to wallpaper or caller ID.  Last but not least, you can simply keep your best on-the-go pictures and laugh silly at them on your commute!It ought to be emphasized that you mustn't expect too much about the picture quality.  It reminds me of the first-gen digital cameras that came out back in 1995.  Fuzzy and distorted colors best describe the images.  The quality is also very sensitive to hand shakes, so often I use one hand to hold the phone steady and the other to press the shutter button.  This is especially true when you use the self-portrain mode.  I personally find the camera work best in low-light settings like inside a bar, and also on beautiful summer days.  The minimum distance to subject is around one foot in order to get a focused picture.  The point is, the 8100 is more a fun toy than a serious (or semi-serious) digital camera.  Snapping quick shots of people fighting outside Yankees stadium is fine, but family get-together photos are no-no on this.Now a word of warning: in places like New York City cops have started arresting people who surreptitiously take pictures of girls' behinds and legs and whatnots.  Please use your phone responsibly!One more virtue of the 8100 is its affordability.  In short, this is a terrific camera phone that you'll get addicted to easily.  Many other users seem to agree: less than a year after its release, it's already the best-selling phone in Sprint PCS's entire history.
I bought this phone two weeks ago.  It is very nice as a phone - compact, light, with enough volume in the headset so I can hear it with the car top down (but not at 80 mph!).  The keyboard is logical and lightly backlit.  All the set up and control functions can be accessed at the press of a button.It has lots of really nice features.  The 1.8" screen is bright and colorful, with good resolution.  It has a built in camera which takes fairly good pictures which you can use as your screen's background.  You can also e-mail and upload the pictures if you pay for the service.  The battery lasts forever.  The phone has PCS web access.  You can also download games and programs to make the phone more functional.  It has a built in calculator.  You can use it as a modem if you purchase a USB cable and software (which Sprint no longer provides).  You can upload the pictures to Sprint's web cite and then e-mail them.  The pictures you take or d/l can be displayed as four to a screen thumbnails.So, what's the catch?  "Sprint" charges for everything.  And the contract is for two years.  You can upload pictures, backgrounds, ringers and software from your computer -- if you buy for the cable and software, which Sprint no longer supplies, but I can't find software to d/l my pictures directly to the computer.  (The cable and software can be purchased separately, but not together!  There are three sets of software -- again each sold separately!)  If you want access to your pictures, you have to upload them to Sprint's web cite, and then download.  Sprint charges for this service.  I bought a USB cable to try to use the phone as a modem.  I used it for a very short period, and had my phone turned off the next day because I ran up a bill of $80.00.  In some ways, it is kind of offensive.  At least they reversed the charge because I had two months free trial!10/30/04 -- As an update, I have now had the phone for almost a year.  I continue to be happy with it, although I think I might like one with a speakerphone built in.  The battery has held up and continues to last for days.  In addition, I have found that Sprint's coverage in Los Angeles and Orange County areas is very good, and I lose reception much less than I did with AT&T.;
While you shouldn't expect this phone to replace your digital camera, there is something great about having the ability to send someone a picture on a whim.  The Sanyo SCP-8100 would be a great phone even without the camera!  The menus are very easily laid out, and very easy to read.  The screen is large enough to read 9 - 10 lines of text off the web (I love reading SI.com's writers' columns).  Adding the ability to take pictures just makes it better!  I travel some with my work, so I enjoy getting pictures of my children while I'm on the road. Photos can be sent to up to 10 e-mail or phone addresses at a time.  Voice messages can be sent along with the photo.  Sprint's service even allows people to reply to the photo, so I can get comments attached to the photos.The only reason I don't give this phone 5 stars is due to resolution for pictures.  It would be nice if the resolution was a little larger, so you could print off small photos.In spite of that, I'd certainly recommend this, along with the plans provided by Sprint.  Great plans...great phone!
I tend to upgrade cell phones once a year, and this is my latest that I've had for a month.  Relative to the "state of the art" a year ago, here's the pros/cons:- Photo feature is very fun.  I have no "real" use for it, but it is extremely amusing to have the photo of the person come up as their caller ID.  Emailing a picture is slow.  Picture quality is good enough really only for use on the tiny phone screen -- even on a computer the image looks lousy, and it certainly isn't good enough for printing.- Range is a big improvement.  I'm getting service in areas I didn't use to.- Slightly thicker than not having the photo option -- so there's a slight "carrying cost" to the camera- Sound quality is mixed.  Even though the reception is stronger, for some reason voices sound a little garbled on this phone.  You have to line your ear up just right too to listen.
Well first of all let me say when I first got the thing..i couldn't put it down...for three days straight..this phone is freakin awesome...most of the time...yes i have had the prob with the earpiece..the thing just doesnt direct sound very well is all..you realize you're off and adjust a bit and you're fine..i dont know what ppl are talking about when they say poor picture quality...what do you expect from a camera that's smaller than a dime..the thing is really quite amazing..and 640x480 really isn't something to scoff at..it'll take some great photos...where this phone has really failed me is reception and overall service..let me just say sprint is a pos...if at all possible..stay away from them...it's very unfortunate that such an awesome phone must be tied to such a horrible service...dropped calls all over the place..and that free and clear digital buisness? it just means that rather than hearing static, you'll just hear the phone cut out periodically..i don't know if their network is weak here in So. Cal or what but i can have to walk about 20 ft away from my house to get a signal. and the data transfer? FORGET ABOUT IT...I've never been so frustrated with my text mesaging in my life...the thing will lead you in circles and not get a single thing done..Personally I plan to switch to ATT mMODE will do the same things better than PCS vision ever could. The ring tones are awesome, but a bit of a ripoff at 1.50 a piece...the ringer itself i did have a problem with: when set to high, the polyphonic tones will crackle and come out sounding not all that great. Also one last note...the more things that are packed into a phone, the higher the chance that they will break...I used to have my trusty old-school nokia and i could dropkick the thing, dunk it, and it wouldn't phase it in the slightest..I left the 8100 in my pocket when i fell asleep and when i woke up, the screen was dead...when the screens did work though they were incredible..when i flipped open my phone for the first time the display took my breath away. The sub-lcd is pretty trick also; the photo color id is one of the coolest things the phone does...overall here's what i thought of the phone:Pro's:Chocked full of features,nifty camera takes nice picsvery vivid color displays, some of the best available.Con's:Horrible service and supportQuestionable qualityVerdict: An overall great phone that just happens to be paired with a not-so-great service. If you don't absolutly need the clamshell, go with the Nokia 3650; you'll get a better service with ATT and it'll do everything the 8100 will and more...
i have owned this phone for more than 6 months now and well i have never had any complain of dropped calls, or poor signal reception. I find strong signals in areas where my previous samsung phone or motorola phona didnt have signals. the camera is okie nothing great, yet goodenough for camera wallpapers, but honestly you need a phone not a serious digital camera. The organization of menu and battery life is decent. Overall i love this phone, but wish it had infrared or bluetooth connectivity to my other devices.
I've been very happy with this phone since I bought it. I've only had it for 2 weeks, but no complaints. Yes, the camera resolution could be better. But are you buying a phone to talk or to take pictures? I bought it to talk.
I purchased the 8100 only because I lost my LG phone which worked well for me in the time I owned it.  The 8100 has all these extras that come in handy.  The problem is the lousy customer service and the large percentage of incompetant people that you have to deal with.  I feel sorry for anyone who has to call them for technical support. If your phone works fine and you never have to deal with them, then count your blessings.
Great phone!! To get the most out of this phone, you need to get the PCS Vision. I wasn't really impressed with the built in camera feature, but what can you expect? its a PHONE!! Another great feature about this phone is the ability to surf the web. You can visit almost any site with this! Overall, very lovely phone.
Not for a single moment do I regret buying this phone. It is just AWESOME! The camera is cool, even with a bit little resolution. The menues are just perfect, incredible inside and outside display. Java, games, internet...oh my gosh, this phone really rocks! I am on Sprint now and regret the service a bit for its high prices but the phone definitely worths it. I am waiting for my rebate to come so it will be even sweater - FREE!
I am a very satisfied 14 year old. I got this phone 2 weeks ago and I love it. It has so many things you can do with it...Screensavers,ringtones,games... I spent way too much money downloading those things but who cares... Sprint service is a little high though, $50.00 a month for 300 minutes plus PCS Vision. The camera is of higher quality than I thought it would be. Plus if you don't want to buy the PC link cable thing for $20.00 then you can be cheap and take pictures of your computer screen.lol.Overall a very good phone
i own this cell phone. this cell phone is really good for its price you could go online and download games, screensavers, and lot of other things also if you are a member of msn, aol, or yahoo you could log in and chat with ur friends and it has a lot of other features so, that's why i think this phone is really good.
Now, in all fairness, this website does an excellent job of showing off this handy little gadget wanted by every teenager in the country.  However, what they don't tell you when you buy this trouble maker is that after you've spent $229.00 (not including tax), you have to pay for everything that you thought you had already invested in.  Make sense?  You see, the phone is a cute little gift for Christmas and everyone rushes out to get it.  What they don't realize is that everything you want must be downloaded.  For example, all the hot new songs that teens want as their ringers cost extra money to download.  Getting a connection to the web costs extra money.  Text messaging your friends cost extra money.  Sending pictures (which the phone takes for "free") to your friends costs extra money.  SO what exactly is it that you're paying for?  The style of course.  If you don't mind not having the hippest ringers or keeping all your pictures to yourself or not being able to check the weather on the web via your phone, then this is the phone for you. Oh, and not to mention, if you want to protect this expensive beauty, you'll have to invest in the $30.00 case that fits it.  Worth it? It depends on how bad you want it.
I don't own this product yet but I've been checking LOT'S fo reviews and looking at alot of pictures. I've been comparing the SANYO at Amazon.com with a lot of other phones and I've noticed that there were some features that the SANYO 8100 is capable of when Amazon indicated that the phone was not able to do. Can anyone E-mail me at Data1880@aol.com and tell me where I can find the TRUE features for the SANYO 8100. Thanx
IMPORTANT: This phone is marketed as a world phone. It is NOT a world phone. (The European version - T610 - is a world phone.) The T616 is for the North American market. The GSM standard in The States isn't yet as far reaching so there is now an 850mhz frequency to supplement the 1900mhz. The T616 is equipped with this "filler" frequency as well as the standard N. American 1900mhz. The third band (1800) is used in Europe and other places as well. So, this is a tri-band phone, but it is not a world phone. True world phones us 900mhz instead of 850. 900mhz is used in Australia and New Zealand. If this important to you, DO NOT purchase a T616. World phones need 900/1800/1900. Keep in mind, most salespersons aren't aware of this.That "said," the T616 has a clean, elegant design. It's very well equipped with lots of functional features. Fits anywhere. Holds a decent amount of photos, even more if you delete excess ring tones and games. Picture quality is as good as camera phone photos are. It has both bluetooth, infrared and USB connection. The phone also allows callers to conference call with up to five other parties... and even click one aside for a private while the others chat. Great feature if you need it.The screen is hard to see in the outdoor sun light.A speakerphone would be nice, but for the price and size, it's a VERY well equipped phone. As it is not a flip phone, it can be answered with one hand and the body integrity is solid.Aside from the world phone lie, this is the best of the seven mobile phones I've had over the years. Because it has the additional N. American frequency, it probably gets better GSM coverage than other tri-band GSMs with only the 1900.
My seventh mobile phone and easily one of the best. The reasonable price combined w/ the small size make this the best featured phone on the market.Sony spared no expense in giving the the T616 both bluetooth and infrared, a camera, email client, 65k colors screen. One of the neatest and rarely mentioned features is an alarm/calendar system which can be programed to alert even when the phone is turned off. Save your juice and still get. Of course it has all the too fancy ring tones and games which only take up memory and might be better in a teen flip phone.The design - modern, sleek and simple. I'm not a clamshell fan, so a small, solid, one-piece unit with a large color screen is right up my alley.On the down side, AT&T's service does not allow for one-touch voicemail pick up. You must enter your password w/ evey call. A security feature, I guess, but annoying. Additionally, the screen is difficult to read in bright sunlight. My only other gripe is that there's no speaker phone. Sony was clearly going for sleek and small and for the money and size, how much more can one expect?As for AT&T's service, keep in mind quality of service depends on the region you live in and where in the region you live. Every company has cities where their service is great and where it is lowsy. So these sweeping generalizations about AT&T's service should be taken with a grain of salt. Additionally, this phone operates on a GSM network which isn't yet as all-encompassing as TDMA/CDMA... but unlike the 'DMA's allows for international use. So, whether T-Mobile or AT&T, GSM service is GSM service. On that note, only AT&T offers both GSM and DMA, though the Ericsson is designed only for GSM.Be ye warned, although this is a tri-band phone, it is not a world phone. World phones include 900/1800/1900 mhz frequencies. The T616 carries 850 in place of 900. 850 is a second N. American frequency at the expense of the standard 900mhz which covers Australia and New Zealand. If you're jonesing for this unit, the T610 substitutes 850 w/ the standard 900mhz.I highly recommend this phone for style, quality and features. As for AT&T's service, it's as good as any other similar system depending on where you are.
FIRST, this is a great phone.  my only real annoyance is that i keep the phone in my pocket and the faceplace has quickly become slightly scratched.  can imagine if i was not being careful of quickly and majorly scratching the screen.  sure, i can change the faceplace anytime to get a fresh screen but still, a little disappointing.people should know that at&t is upgrading their customer service applications.  what this translated to is instead of being a 1 week upgrade at the beginning of november, they continue to have major outages (hours) each and every day.  their ability to access accounts has not been, in my mind, acceptable.  further, after being a customer with verizon, i have to say that the level of professionalism that the AT&T customer service reps AND their resolution specialists (their version of escalation) has been quite low.  this is a big enough issue that i would say you should WAIT until they have completed their upgrade to move, if you move at all - they do not have an estimate as to how much longer it will take, which translates to me that this is an ongoing problem and they don't know what the exact problem is (or at least, how to fix it)!I live in new york, so you'd think that there is plenty of coverage but believe it or not, there are some dead zones.  I'm "ok" in that the phone works in my office and at home.  may seem small but this is a big thing for me!!!hope this helps in your decision...
This is a sleek little phone. Wonderful to the touch - smooth finish. Almost too smooth, as it tends to slip out of your hand or pocket if you're not careful.  Camera is simple to use, photos look good if there is enough light. I have the bluetooth synched with my Lexus - makes the car my phone when I'm in the car, with the phone still in my pocket.With such a big screen in such a little phone, something had to give; that would be the size of the keys, which I have to press with my fingernails (I have big hands).The menus are easy and intuitive. Everything is easy to find. The color screen is really hard to see in daylight. In a room it's great, but look for a shady spot to read it outdoors.All in all, I'd buy it again, mostly for the way it feels and fits elegantly in my pocket.
I shopped a long time for my next cell phone hoping to get a nice phone with a decent camera to snap impromptu pictures. After much research, I chose the Sony Ericsson T616 because of it's rich feature set (camera phone, bluetooth, infrared, mMode, joystick navigation) and teensy weensy size. I had seen the model in an AT&T Wireless store, but when it arrived from Amazon I was still surprised at just how small and compact the phone really is. I immediately started exploring the phone's features and was very impressed with the beautiful LCD, polished interface and nice features and games.Buzzkill time...when I was done playing with the non-phone features and started making calls I got complaints from the other end about poor voice quality. And that was when I actually had enough of a signal to make a call. I'm in the greater Boston area and was surprised by the lack of strong coverage. I would rarely have more than 2 out of 5 bars of signal strength any place I took this phone. Granted, this is a knock on AT&T and not the T616. Every time I looked at, and held, the phone I made up reasons to justify keeping it. Unfortunately, a nice phone with poor service is really a poor phone. The phone gets a 4 (a higher resolution camera might get it the 5th star) but the packaged AT&T service gets a 0 -- net rating: 2.I sent mine back today and got the LG VX6000 from Verizon. Verizon's coverage is nearly perfect and the features of this phone are attractive: full VGA resolution camera, flip design, and a nice LCD screen and operating software (but not quite as nice as the T616).POSITIVES:- very small size- great price from Amazon with free bluetooth headset- excellent connectivity with bluetooth, infrared or cable- convenient and intuitive joystick for navigation- great LCD screen (seemed to flicker a little bit though)- very nice looking and feeling operating software- java support- nice additional software and games- IMHO, quite a good looking designNEGATIVES:- very poor AT&T service- very poor AT&T service- very poor AT&T service- camera is low resolution and not very good (only 288 x 352 pixels)- almost too small for calling comfort- hard to keep clean- did I mention the very poor AT&T service?
I did a lot of research before switching service and purchasing a new phone before I decided on this one.  I was wrong.  The phone has a lot of wonderful and useful features, but...* it is very, very small.. constantly checking pocket to see if it's there* the little nav button in the middle is very easy to use... but you end up dialing into m-mode every time you move it and* I found that I was constantly putting it in to silent mode if I didn't wait long enough for the keypad to lock before putting it away* CANNOT see the screen outside or in the car here in Phoenix, shaded or not, I guess we have just too much sunlight.* volume is very low on highest setting* Extremely poor reception and/or signal. ATT service bites the big one here.  I live and work in the central Phx area and am lucky to get 2 bars anywhere.  Large number of dropped calls and have to redial several times to connect.I am still within my 30 day trial period and I'm taking the phone back and cancelling service with ATT.  Problem, is there isn't anything else on the market right now that has the features I actually want...bluetooth and/or speakerphone, camera, flip phone... don't want or need the data stuff.Caveat Emptor
I bought this phone because it seemed to have every widget that I could ask for at the time (big hi-res color screen, camera, small size, bluetooth, GSM, huge contacts lists and calendar, etc).  Since I received this phone I've had problem after problem.1.  I can't get my Outlook to sync with the phone using Bluetooth, after SEVERAL fruitless tech support calls and going over every manual with a fine-tooth comb.2.  Signal is awful.  Maybe it's the GSM, I don't know.  I had a Nokia through ATT and it got great signal at work and home.  With this phone I dont even have enough signal to get text messages most of the time. I can be standing in the same place and watch the signal indicator fluctuate from 3 bars to 0 and back in a matter of seconds.3.  Sound quality is poor, my friends on the other end complain that I sound like I'm in a wind tunnel when I'm talking to them even if I'm sitting in my living room.  Also the "sweet spot" on the speaker is hard to find.4.  The display is almost impossible to read in direct sunlight, the contrast goes down to 0.  Combine that with the smear/fingerprint/scratch-magnet surface and you're left with a comepletely unreadable screen.5.  The ringtone starts out quiet and increases in volume.  Basically this means that if the phone is in a pocket or another room you won't hear it until the 2nd or 3rd ring.  There is a control in the phone to disable this but it doesn't work.In short, DO NOT BUY THIS PHONE.  There is a comparable Nokia (3650, I believe) that is much better, or if you have the extra cash go for the Motorola MPX200.
I got the T616 to replace my aging LG phone because my new apartment is in a no-service zone of the Verizon Wireless network.  I wanted a GSM phone to have a chance of using it outside the US.  I wanted Bluetooth so I could sync it with the calendar and address book on my Mac, and also so I could use a wireless headset.  I wanted a decent user interface (UI) for sending and receiving text messages. I didn't care about the camera or the web stuff or the games. I was initially delighted. The T616 synchronized beautifully with my computer, had good sound quality, and a generally excellent UI. The color display was nice for photo caller ID. I even found myself playing the tiny preinstalled Q*Bert game. All these features were wrapped in a small, light, attractive shell.  But the reception wasn't very good.  Calls in my apartment were dropped or garbled while my neighbor used his AT&T GSM phone without problem.  I dismissed complaints I'd read online about the display in sunlight... until I got my first call outdoors.  I pulled the phone out of my pocket and the display was unreadable.  Not difficult to read, unreadable.  I might as well have been looking at the phone's backside.  The B&W display of my old phone may not have been pretty, but I could always read it.  The UI was well-designed and responsive, but text input was sometimes less effective than on my clunky old phone and the tiny keypad didn't help.  AT&T was good about accepting a return.
I have no problem with the phone - actually I have been using the same phone (quite happy except for the less-than stellar battery and the easily-smudged body) before I lost it and had to replace it by ordering on Amazon, the beginning of my woes. I badly needed a replacement since I give out my number at work. I passed on the free-shipping and ordered 2-day expedited shipping - on day 3 I get an e-mail informing me that the items are delayed and will ship after two days. I am making other arrangements and lo behold the phone arrives - well, cannot complaint too much there :) As per instructions, I turn on the phone and wait for 45 minutes for the phone to be automatically activated (per instruction leaflet). After a frustating 2-hour wait nothing happens and I call AT&T. After taking down my entire life history I am told that the "systems are down" - a common support-insider-statement for 'moron it is our coffee break'. I am asked to call after 2 hours, which I do; the biography dictation again; this time I am politely told that since I bought it at amazon I need to call them. Ok, I call amazon. After the mandatory questions on order number, mother's maiden name, father's height - "Oh, you want to activate a cell-phone. Well, our cell-phone dept closes at *4PM PST* - please call back tomorrow". Tomorrow dawns, I call amazon - same questions, no answers - this time it is "Oh, the AT&T systems are backed up. You could leave the phone on for a while (and between the lines "hope for the best") or I could submit your information and have the system activate your phone in 24 to 72 hours." I chose the latter - I'm still waiting ...
First, the service:  I was happy with ATT wireless GSM while I worked at an office less than 1/4 mile from Interstate 66 (15 miles west of Washington, DC), and my route to work was ON the Capital Beltway (I-495), but now I am 3 miles from Interstate 95, 16 miles from the heart of DC, and my route is NOT on the Interstate, and I *NEVER* CAN USE THE PHONE (to|at|from) work!!!  I tried calling customer service repeatedly (6 times in one trip to work) and have never gotten through or stayed on long enough to get my point across.  DO NOT BUY SERVICE FROM AT&T.  THEY DON'T HAVE A NETWORK!!!  You can be "lucky" like I was for the first month, but I GUARANTEE you that you will eventually be thinking of throwing the phone out.  I was very happy with my old (non-GSM) ATT service--getting connections just about every time--but now I *NEVER* get a connection.  To top it off I recently tried to call my wife from the grocery store and found that I couldn't--even after walking out into the parking lot--and the grocer is 1/2 mile from the Capital Beltway.  They'll tell you that the hurricane damaged equipment, or that sunspots are interfering, and the customer service reps even say things like, "well the technology is new and it isn't perfect, and like all new technology it is going to have problems..."  (That's what they told my wife today.)Second, the Phone:  The T-616 is a very nice phone, with lots of features that are quite usable as long as you don't require a connection to a network.  (The only reason I carry the phone now is that I have over 300 numbers and addresses in it.)  The HUGE problem with the phone is that you can't read the screen in daylight.  That nixes all of those nice features and makes you wish for your old Nokia that just plain worked--all the time, day or night.  The battery life is NOWHERE near the marketing promises.  I can't even make calls and I am surprised how often I am charging it.
This phone looks sexy, feels sexy, and overall is a nice piece of hardware. But it has shortcomings:1. The camera takes fuzzy pictures with muddy tones.2. It doesn't have nearly enough memory. I can only take 3 pictures before I run out of memory.3. Sometimes when a call drops or another call comes in while you're on the phone, deafening noises blast into your ear.But the phone's shortcomings pale in comparison to AT&T; Wireless's:1. They claim to be upgrading their customer service computer systems, so you might wait on hold for 10 minutes or more only to be told "I can't help you because our system is down. Call back in an hour." This has been going on since October.2. My wife and I have identical phones and service, but can't send pictures to each other because the mMode has never worked. We've had option settings sent to our phones several times by customer service reps, to no avail. In the month we've had our phones, we've never been able to log in to mMode or surf the web. So the data portion of the plan is a total waste of time and money. And getting it fixed is difficult - see item 1.3. AT&T;'s GSM voice service in the San Francisco Bay Area is far inferior to their old digital service, which worked well for me for 6 years.Overall, my wife and I agree the phones look cool and have an intuitive interface, but we should have stuck with our old phones and the old digital service. We regret the switch.
I made the mistake of buying it directly from the ATT&T Wireless web site and my experience with them was horrible. I checked their web site for order status and was greeted with a message that said an email had been sent to me requesting additional information to process the order. The trouble was that no email had been sent!! Worse, when I tried to contact customer service by phone, the order status line was busy for hours at a time. When I finally got through, I was put on hold for over 20 minutes and then disconnected.....twice.I have never had these problems with Amazon. Or any problems.The phone, however, was delivered in an acceptable four days from the time I placed the order with ATT&T and I must say it was worth the aggravation.If you like the way it looks (and I do), you can't help but be impressed with the build quality of this phone. All first-rate materials, with aluminum cladding on the front bottom third, aluminum covering the back bottom two-thirds and aluminum on the sides. The balance is high-density black lustrous plastic. This is a solid phone.So how does it work? Very well. I live in New York City and I have used it all over town. I had it with me upstate and it worked fine by the side of a lake. No dropped calls. Anywhere. The sound quality emphasises the higher frequencies, which is good for these aging ears, but the sound is not quite as good as, say, the Motorola V60 which this phone has replaced.The features packed into this phone are extraordinary and it will double as a PDA. Entries can be made either directly or via infrared or bluetooth with your computer. The camera function is good for a spontaneous snapshot, but you won't want to use it for important pictures.Yes, the screen is a fingerprint magnet and the screen is washed out in bright sunlight. Shield it with your hand and you can see it. Before you buy it anywhere, check out the offers on the ATT&T website. The phone was offered at the same price as here, but with an instant rebate one one hundred fifty dollars, which meant I paid fifty dollars when I bought it directly from ATT&T. However, they offered me an extra one hundred anytime minutes a month for the life of the contract which works out to about two dollars a month for those extra one hundred anytime minutes over two years. IMHO, a better deal than getting the phone for free.
This is a great phone, i have no problem with it. They keys are spaced, the ittle ball which is used for navigation is difficult at first however, it becomes easier until you get used to it. Bluetooth, infared are all extremmely easy ways for it and my computer to exchange info. The games are great, the music is loud. Reception is generally good compared to my other phones. its small and light, i would recomend it to anyone.
This is a nice phone.Its small and compact, and filled with features.I like it a lot, but this web-site has it for a high price.You can find this phone free and for $50, if you look.I went to the att store in my mall, and they had it for $50.00
The phone is difficult to use, with such a small keypad and the display, while crisp, is difficult to see unless you have a magnifying glass.  Pictures taken with the phone are grainy, and quality is really bad.  As for sending the pictures via AT&T, expect nickel-and-dime charges for the data transfer.  I am returning my phone to AT&T and cancelling my service (still within 30 day guarantee).
I love this phone. AT&T is still building the GSM network so coverage can be spotty, but I think it's worth it. The sales person at the AT&T store told me that TDMA has better coverage so I was not in for a shock once I used it on the GSM network. Internet access is fast and convenient. Camera is fun too!
If you want to tranfer your number .. This may not be the phone for you !! All phones from amazon come with a new number and the att customer service will not provide number portability from your old carrier. The quality of phone is good if you are looking for a brand new number and the jebra set works perfect. The infrared port did help me to transfer my old telephone list to the phone through my palm instead of adding them manually.
I like the phone. Cool features like Bluetooth, IR, Camera(sort of) and a colorful screen(at night).But ATT Customer Service is HORRIBLE, JUNK, WASTE. (Cann't think of any more words worst than this). It's more than a month since I requested them to transfer my number from Sprint, but in vain. I have to carry two phones all the time. At times it has taken me more than an hour to reach a human being on the ATT customer service line. VERY RUDE & HARSH Service. NOT AT ALL HELPFUL.AMAZON should stop selling ATT Service, otherwise they might spoil their reputation.Hope someone from ATT reads this review.
First of all, this is a great cell phone.The best of its features is its amazing battery life.  It can be on for at least 3 days without the battery dying.  Secondly, the interfaceis very user friendly and everything is a click away.  The compact size of the phone also is a plus.  It easily fits in my pocket, but i still know its there.There's only two minor problems.  The first, which is VERY minor is that the surface is not very smudge proof.  The second of the minor problems is that sometimes reception is lacking, probably AT&T's fault, but it does happen.Overall, a great cell phone that would satisify anyone.
I love this phone! I mean it's got tons of cool features... small.. battery doesn't drain like all my freinds... I get better reception better then all my friends that don't have this phone.... Bluetooth is rad too. Get this phone it's worth every penny
AT&T wireless as a company is not prepare to service any customer. Please try their customer support line before ordering the phone. You will be on hold for hours and at the same time the department that handles your number porting is different from the ordering derpartment which is also different from normal customer service. If there is any issue, there is no single point of help so you will end up waiting hours on hold.The phone is nice but don't get the service from AT&T. The provider is bad.
I've had my t616 for about 5 days now, and am impressed by the quality, the clarity and features.The camera leaves a lot to be desired, but the call quality is wonderful. I got it in part to other reviews I read and the availability of accessories for it.I beamed over contacts from my pocket pc and palm os devices with minimum hassle, as well as being able to send and receive contacts from other bluetooth/infrared phone users.
I have had five different phones on the AT&T GSM network. Yes, the network is weak except in urban areas. But this phone has **horrible** reception compared to other phones I have used on the same network. Siemens and Nokia are far, far superior in reception. This phone fails to dial half the time from my office and home, and routinely misses calls.Too bad, since other than that the phone itself is pretty nice UI-wise. But steer clear of this, and the T68i -- pretty much any SonyEricsson phone. They have a lot to learn about reception.
This phone is an excellent phone.  It has a very good color screen, it is well disigned, the camera is pretty good for a phone, and it has numerous features.  For example, if you have a Palm Pilot or Pocket PC with an IR sensor, you can transfer phone numbers, to-do items, and more.  You can aslo record soound, apply themes to you background, and surf the web.  The phone has a very nicely layed out case and menu thats easy to navigate.  It also has a very quality feel when you hold it in you hand.  The only very minor problem with this phone is that the case smuges easily.  Sony includes a nice cloth to wipe it down with.  Besides that, this phone is incredibele.  I got two of them under a family plan with att and have not been dissapointed.  The price is ok, so I would give this phone a 5 out of 5.
T616 - This is my second phone after motorala v60. I wished I sticked to motorola. I wanted a cool color phone with camera and all the latest technology. Thats how I got into this AT&T and amazon offer trap. I saw this phone is free and ordered it in Amazon. Amazon charged me $100 and said I can get my money back from AT&T if I sign the contract and send them the papers. The response I got from AT&T is that they don't have any offer like that. Now I am confused as who do I contact for this mess. Please think twice before deciding on any nice deals. especially Amazon on AT&T phones suck. The phone's reception is also too bad. I am paying $30 and above a month just to make calls while i am at my home or or at office (the reception is good only in these two places for me) I dont want to go for another phone as I am kinda used to this mess. If you wanna make ur life more frustrating, come join me.. buy a T616 from AT&T (at amazon)
This was my first non-Nokia phone, and I too returned it at the end of the 30 day AT&T; no-questions asked return period. I've had AT&T; for years, though this was my first digital. I've always had great customer service from them ....T616 Positives:- Beautiful looking, small, lightweight.- Display has great color graphics and themes.- Bluetooth synching my contacts via isync on my mac was fantastic. See below for limitations though.- Bluetooth for internet access: My friend uses his to access the internet via his Powerbook. When I saw that was when I wanted to buy this phone! But he has Sprint with unlimited data. AT&T; doesn't offer an unlimited data plan. I imagine with AT&T; internet access could get pricey.- Fun taking my friends photos (yes, grainy, but fine for a phone) and and assigning them to their contact info so that their photo would turn up when they called.- Good loud rings, sounds great though the first ring is softer.- AT&T; customer service and return policy.However, other than that, this phone was pretty limited:- It took quite a bit of manipulation to get my mac's address book fields matching (several syncs to see what went where and reorganizing the contacts on my computer that were going into the phone) and it does not store addresses. Limited length on what you can save in the Calendar or transfer from iCal. Not a PDA replacement by any means.-The keys are so small (and this phone was the same dimensions as my last phone) I was constantly hitting the wrong ones. Forget texting or trying to enter an appointment.- Display: Tiny display fonts very hard to read. Agree with other reviewers too that its unreadable in daylight.- Slow response time. I like that you can press the joystick to select (rather than having to use a different key like you do on Nokias), to search for a name in a big contact list is slow... it hestiates between each step.- You have to have it positioned exactly right on your ear to hear what the other person is saying, so each call is this moving around the phone to get it just right. Once you do that though, the sound quality is crystal... but what good is that if you aren't getting your calls or can't make them?- Battery life. I am a very light user and had to charge it every other day at least. Other phones I've had could go many more days.- I couldn't get the phone to send pictures to anyone. Friend on Sprint couldn't get his photos to send to me either. Couldn't figure out how to bluetooth them into my computer but didn't try too hard.- Navigation system is counter-intuitive, though I was using this phone for 28 days and read the manual. To lock the keys if the phone has to go to sleep requires pressing a key to wake it up, then clearing what you've pressed, then pressing two more keys. Everything took more steps than my previous phones, and in the end the annoyance was too great.- Reception was awful compared to all my previous phones. Sitting side by side with someone also on AT&T; digital, their phone (Nokia 6800) got two bars and mine was red with no service. This was in LA, NY and Boston metro areas. Sometimes it would tell me I had service but then suddenly I would get three calls that had gone to voicemail, some of them from hours earlier. Never had this happen before on other phones.....
I bought this phone online from AT&T which was a BIG mistake. I had questions about a few things before the phone is shipped and I was put onhold for 3 hours! I tried several days calling their customer support and was put onhold for hours every time. When I did get to a person, I would be given many other phone #s to try and I ended up running in circles for nothing. So, I decided that I don't want to deal with this and just return the phone. It took me yet another few hours of calling before I can finally get the return label shipped to me!! The experience is horrific and I will NEVER buy anything from AT&T online.
This phone is a wonderfully small phone. It's very compact, despite having a camera ald large display. Reception with this phone, however isn't that good, but that may be AT&T's falt (reception isn't reflected in the rating). Despite the poor reception, voices come through relatively clear (seeing that reception is usually in red or yellow squares). It's screen is extremely clear and readable under most conditions- it's hard to reat with the screen facing the sun. The screen smudges easily, but it seem quite scratch-resistant. This phone could use mroe memory, though. It's feature-packed, like many Sony Clies are- it has a stopwatch, calculator, mini-PDA features, bluetooth, infared, and pre-installed games, ringtones, themes, and pictures. It came with a headset. The battery life is also good- it lasted a week in endless keylock before it needed to be recharged.
Just wanted to let everyone know.  The time from order to shipping on this phone is over a week which means that it's probably too late to order for Xmas at this point.  The TMobile T610 ships almost immediately.The other thing to consider is that the TMobile T610 is actually cheaper than this phone since the supposed -$150 price is only for a two year contract.  With a one year contract, the price is only -$75.  TMobile with one year contract is -$100.Also TMobile has better service plans.
After being a Nokia fan for many years, the T616 grabbed my attention.  It's sleek design comes packed with a ton of features.  The built-in camera is great for quick shots of my daughter.  Then it's a simple process to quickly email the pic to a list of family and friends.  Syncing with Outlook for contacts is also fantastic.  The screen is high quality as well.I've only had 2 problems:1) getting used to the navigation after using Nokia's for so long2) AT&T coverage near my home is somewhat lacking; although in the city it works fine.
Sony Ericsson is one of the leading manufactures in the cell phone market and has constantly produced phones that have not only met but exceeded the expectations of cell phone users. Their new, high-tech cell phone, the Sony Ericsson T616, is no exception. With its quality 65 536 color display, extensive picture sharing options, the latest messaging, built in camera, Bluetooth wireless technology, and several, several other features, it is no wonder why the T616 in my opinion is one of the best .....read more @ Bytesector.com"
If you want the best of the phones in the market now and you are also looking for one at a good deal.. go for this.. it has got everything u can ask for.. blue tooth, camera, triband.. I heard the  AT&T GSM network is not that good.. but my phone T616 seems to picking up the signal well. I really didn't have any major call complaints with this phone at all.. The reception is really good .. I wonder why somone has blamed the reception.. I got this phone so that I can use it in India as well.. but I heard that AT&T don't unlock the phone even after the contract is over. I just hope this isn't true.. If they dont unlock, whats the point in going for a triband phone..
ATT cover is bad and phone doesn't work or goes roaming after every 5 miles. If you are thinking of number portability -- don't think.... it takes 30 days or more to get it done
This phone sucks. If I could give it negative stars I would. The color screen is great indoors but once you get in the sun you can't see it at all. It looks cool and it has a lot of features and is easy to navigate but where it counts it really sucks. It gets no signal, and trust me, it's not the service because I returned the phone and got a more expensive Motorola that gets a better signal, you can see the color screen in the sunlight and I can hear the person I'm calling. I tried to give this phone a chance but when I made a few calls on it I could not hear the person on the other end at all. So unless you plan on using this phone under a tree shaded from the sun on top of a hill on a very quiet day, don't get it. Once again Sony dissapoints, they need to stick to games.
I received my phone fully confgiured in less than 2 business days. Have not had to deal with Customer Service because everything worked perfect out fo the box.
The phone is good, but att service is the worst. It takes 3 weeks to get the phone.
AT&T customer service sucks. I was with Sprint PCS before, and their customer service was far better. I am regretting the move. BEWARE OF AT&T.Great phone. Good features. But in a noisy environment you would not hear what the other party is saying. The maximum sound (both ringer and call volume) in this phone is almost equal to the minimum sound with my previous Samsung A500 Sprint phone.Other than the issue with the audio volume I am very happy with the phone, but once again AT&T has a very bad customer service. I would not recommend anyone to come to AT&T.
hiamazon service is very good. got the phone in two days.  It mentioned that, the phone will be automatically activated in 45 mins of charging..made my first call to amazon to ask them what my phone no. is..they said, at&t has problems in their activation server and so i need to wait 1-3 days.  waited 1-3 days, called amazon.  they asked me to give a call to at&T.  called them on 3 days, but phone always busy, and at times it will automatically ask me to call later and disconnect ??finally spoke to some one and thank god, they activated my phone..but gave me a number that is a not a local number for me.  told that to the rep immediately and asked for a local number.  she gave me this no. 1-800-642-5383. i have called them 8 times and i have waited 87, 65,140, 45, 75 mins, with still no success.......the reason to buy this phone was to give a local number to the school, so that they will call incase of emergency to my wife.  the school wont call a long distance no.  the entire purpose defeated.  i planned to get this phone and cancell my old one..now i am paying two monthly fees...i even suggested that AT&T should give me some credit bcos of their problem...no use..i hate AT&T............(now i am on the phone for the last 55 mins on hold)
I got the phone and love it. I called AT&T 3 times trying to active my phone and port my number but all I got was waiting and waiting and waiting...  What good of a phone when I can't get some one to activate it. This is really suck.
I was seduced by AT&T's pitch in the NYC area of tons of minutes and very inexpensive phones.  I picked the T616 on its reviews, and the phone was fine, except the reception from AT&T stunk.  At my desk, I received no signal, while T-Mobile and Verizon users received full signals.  My wife could barely hear me when I supposedly had a full signal.  After 3 days, I cancelled the contract, after much hassle from AT&T (Their questions were "Are you sure you are using the phone correctly?" and "I'm sorry you are having reception difficulties, would you like a free leather case?" I switched to T-Mobile and have no problems whatsoever.
I liked the phone but it's locked so that I can use onlyAT&T simcard. In-spite of me signing up contract with AT&T they are not ready to un-lock it and that's ridiculous. I would recommend to buy the instrument but not with AT&T. I am not sure but T-Mobile has similar offer and they unlock it for you.
I have ATT for wireless shared plan, I have a great deal of problems with the their customer service, and the plan are outdated with the competetion, they need to catch up with the other world.
Phone is fair but service is so bad.
After I placed the order from Amazon, I called the ATT customer service to work with the phone plan. As I haven't got enough amount ($800) in my debit card account, the guy told me to go to a ATT direct store to pay the phone service deposit of $800. When I got to the store, the representative told me that I cannot pay the deposit without a phone number. And they seems do not know anything about the connection of Amazon with ATT about this phone + service plan. After several visits to that shop, I still cannot get a phone number. I finally cancelled the order from Amazon. I think the representatives in ATT do not know much about the system of their company and they really need more training before they can serve customers.
But AT&T ?No way, I wouldn't consider it no matter how cheap the phone is.
Can someone please post the detail difference between these two models? I cant find any from the product manual.Thanks.
i 've never have any ericsson phone product. people said that ericsson is the good one. so i must considered and try it:D.
This phone has worked well for me.  The sound is clear and reception is fantastic.  The sound of the music is pretty good with the supplied headphones and the microphone/headset is crystal clear.  I have not been lucky trying to find a case or other accessories for this phone.  The only accessories that seem available mostly all came with the phone.  I have not found a case that fits it right to date.The music software seems to work well.  And the recording capability of the phone is also pretty good.  I like the full keypad for entering contact info.  It is a lot easier than with other cell phones.One final note - I wish they had a phone disabling option in order that the music player on the phone could be used in an airplane.If you're looking for a phone that is a little different, offers a little more than a standard phone and is easy to program and add contact info to, this is a great phone.
I chose the 3300 (despite its slightly childish look) because I thought a phone/music/PIM combination would give me all the functions I wanted in one machine without going into expensive smartphone territory. But it's been an incredible disappointment, for several reasons:1. The music player can supposedly play AAC files as well as MP3, but it's a different protocol from the AAC used by iTunes. If you want to copy tracks you ripped from your CDs using iTunes' default setting, you'll have to convert them to MP3 first.2. It can't sync directly to a PC--no Nokia PC Suite is available for this model (nor will there be, as I was told by customer service). Apparently, the only alternative to entering all your phonebook/calendar entries by hand is MightyPhone, a 3rd-party web-based service that costs an extra $3/month.3. The Nokia Audio Manager software is terrible! It couldn't complete a single track transfer to the phone, and it froze up for a solid minute while trying. I wound up just copying tracks directly to the drive, but then strange things happened to the track list, which I had to edit in NAM.4. The earbuds on the stereo headset are too big for most women--I simply could not steadily place the right-side one in my ear, and it fell out whenever I walked. (The only way to stop it was to hold the microphone ... but isn't it the point of headsets to free your hands?!?) And since the headset jack is proprietary, you can't just substitute your own headphones.I suppose this might be OK for a kid who just wants a cool-looking phone with decent sound. But if you depend on the PIM functions, I think you'll be very disappointed. I'm exchanging it for a Nokia 3650, which has PC Suite, Bluetooth, and the ability to download other applications (including MP3 players).
I like the full keyboard which is good for contacts, notes and text messaging.  I also love the radio/MP3 player.  I take it to the gym and can be in touch and use the phone ear plug for the radio...better than a walkman!  All the GSM features plus the cool music/keyboard makes this a great phone.I only wish the letters/numbers were backlit and the problem with the keyboard is you lose the ability to map the letters back to numbers for IVR responses (like, "please spell the last name of the person you are calling...")
I bought this phone and within the first couple of days, I wanted to return it!Pros: The features are nice, games loaded in memory and the radio/MP3 player, I love.  The phone is small and portable.  The keyboard is great if you are writing email or text messaging.Cons: The dialpad is too small to make phone calls (especially entering pin numbers for voice mail) practical.  I'm use to using my thumb to dial; now I have to pull the phone away and use both hands (one to steady the phone and the other to push the right button).  Don't think you can just enter your contacts in memory and you won't have to use the dial pad.  You will if you have voicemail.I sold the phone and got the Nokia N-Gage!
On the plus side:  I've had no problems ripping / downloading songs and it's great for text messaging.  It's got a SIM-card which I think is different from (and better than) most US phones.On the down side:  1) the keys aren't backlit so you can't use in the dark.  2) the earphones are horrible:  they're heavy, don't have a clip, have bizarrely long ear wires, and can't be "coiled up" when not in use (so mine are always tangled).  They're impossible to use while jogging.  They come disconnected from the phone if you leave it in your pocket.  Finally, the mic sits about belt level, which is why you always see people holding their "hands free microphone" if they want to be heard.  It's hard to imagine how the same company could make this cool phone & these horrible mic/headphones.In short:  Fine for on the train, but not for active usage.
I thought, like previous reviewers, this would be *the* phone because of its integration of the features I was looking for.But, as already noted, it falls short:* it does not come with a PC Suite to synch* the keypad is not backlit which has proved more frustrating than I would have thought* unfortunately, 64MB isn't quite enough for me (128 would be much better) for use as an MP3 player* the headset keeps disconnecting when I put the phone in my pocketWhat I've really enjoyed (and certainly can be had with other phones as well):* the keyboard is key to using the phone as an organizer and I found it easy to get used to* the headset helps when making calls in noisy environments--both ears are participating* the voice tags are reliable--hold the button on the headset and say your contact's name (or tell the phone to start the mp3 player, e.g.) and voila, it happens...Haven't once had it not recognize my voice tag.As for the extra long cords and the mic hanging real low--the secret (and this was NOT obvious to me) is to open the oblong plastic piece between the mic and the ear buds and re-close it behind your neck...It brings the mic to where it should be, takes the weight off of the ear buds and allows you to take the ear buds out of your ears and have them hang conveniently close by for when you want to put them back in.  It actually works very well.
I switched to this phone from the Motorola T720i, and boy what an improvement.  The T720i was large, flimsy, and slooooooow - naviging the menus was an excersize in frustration.  The E105 fit the bill perfectly with its small size, good construction, and fast menus.The E105's full color screen looks fantastic and adding a picture is as easy as sending an email to your phone with an attached 128x128 pixel jpg image.  Callers sound good on the phone and not at all tingy, and I've had good reports from people I call about how I sound.  Polyphonic ringtones sound great and plenty loud, but unfortunately Samsung didn't include an option to assign specific ring tones to individual contacts or to assign downloaded tones to some events such as an incoming message.  Battery life is good enough for even heavy use, meaning you'll never run it out in less than a day.  A Lithium-ion battery is included, so you can charge the phone whenever you're near a charger without worrying about battery memory.The case is very well designed and all the parts fit together nicely.  It is not at all wobbly at the hinge like some clamshell flip phones can be.  The buttons have a good tactile feedback and logical placement.The built in organizer is very useful and the monthly calender is a great feature (you can view a standard calender layout for the month).  You also have the ability to set three independent types of alarms with the option to have the phone power on for an alarm event.  It also has a voice memo feature to leave yourself a reminder, though there is no voice dialing feature on the phone.The WAP browser (Tzones) works quickly, though somewhat oddly.  Depending on what kind of link you're viewing, you may have to choose Options > Select to select the link rather than just selecting it...there doesn't seem to be any rhyme or reason to it.  There is also no way to access bookmarks stored on the phone once you're in Tzones - you have to exit out of tzones to get to them.  Fortunately, T-Mobile has the option to store bookmarks online in your Tzones menu.  When viewing pictures or listening to ring tones online you don't get an option to save, as they are automatically saved any time you view/listen to one.  If you didn't want it, you have to go into your phone and delete it.  If you did, you'll want to go into your phone and  rename it.All in all, despite some minor issues the phone is strong in all the areas required to make it a great phone and I'm glad I purchased it!Pros:Compact & LightweightGood Construction (not wobbly like some clamshell flip phones)Fast MenusGreat Color ScreenLoud Polyphonic RingerGood Buttons w/Tactile FeedbackCons:No Voice DialingSome WAP Browser OdditiesCan't Assign Ring Tones To Individual Contacts*Edit 08/18/04:The phone is still going strong, and I'm still very satisfied it!  A couple of items to correct though:First; although there is indeed no way to assign ring tones to individual contacts, you can assign ring tones to contact groups (of which you can have 10), and then you can assign individual contacts to one of your 10 groups.Second; the Tzones browser has some features that I missed.  For selecting links, you can use the Tzones button in the center of the navigation 4-way, which eliminates the oddities that I found using the top-left soft key.  By pressing and holding the # key, you CAN access your saved favorites while in Tzones.  And finally, pressing and holding the * key will bring up a Tzones-specific menu while you're in the Tzones browser.
This is my 3rd Samsung GSM phone purchase. I originally bought the R225, then the S105, now the E105. I think Samsung makes a quality phone overall. However, they do some things that aggravate me. The holster that comes with the phone does NOT allow you to make or receive calls or txtmsgs while its in the holster! You simply can't open the cover at all while its in the holster. Therefore, you also can't turn it on or off. Also, the headphone jack is not a standard 2.5mm jack - the jack is standard - in fact, it looks identicle to a regular jack - but if you plug a "universal" headset in there, it will redial the last number you called - this is because Samsung requires a "special" 2.5mm plug for this phone - that means you either have to go back to Samsung for one of these headsets or you have to buy a particular one made for this phone.  Other than that, its a great phone. Battery life is good... I can even read the display in the sunshine (which is a nice improvement from the S105).
This phone is great!  Much improved over the previous S105 model (except for the fact that the S105 is GSM900/1800/1900 and the E105 is only GSM900/1900).  Here are my observations regarding this phone...PROS:* Loud ringtones and ear volume* Good colorful screen* Good AIM interface* Infrared* Handset connector _IS_ standard 2.5mm (unlike the S105 which was not)* Perfect compact size... one of the smallest phones I've seen* Decent battery life and reception* Phone has a solid feel and buildCONS:* No bluetooth* No GSM850 band which makes the phone somewhat less useful if it is unlocked for use with AT&T or Cingular* Some annyoing minor software issues like Java which is not compatible with all midlets, no real ring and vibrate at the same time (instead the ring and vibrate feature is actually vibrate first, then ring)* Rather limited selection of included ringtones (though you can download plenty of new ones off the internet using infrared or cable with free software available Samsung)I think anyone who buys this phone for use with T-Mobile will not be dissappointed.  Also, it is really worth reading the manual becuase there are a lot of 'hidden' features like lighting up the external display with the flip closed by pressing one of the side buttons for a few seconds or how to assign different ringtones to different caller groups.
I bought this phone (with T-Mobile service) because of its diminutive weight (under 3 ounces!) and size. Unfortunately, I am now saddled with a horribly juvenile interface. Beautiful hardware has been married to moronic software. Still, regardless of what follows, I am keeping the phone and rating it 3 stars.Now for the annoying stuff. First off, as others have pointed out, there are no normal ring tones. The closest is T-Mobile's theme song. Great. Now I'm a walking advertisement.But that's not all. Turn it on and you get tropical fish; a light house; a fantastically ornate, spinning hour glass (to comfort you while the address book takes forever to load); and an obnoxious animated "Hello from T-Mobile" logo (and a corresponding "Goodby from T-Mobile" version when you shut it off). Then there are some beautiful icons, in riveting color of course, for each functional category (including the sub-adult "Fun Box"), plus some unbelievably tacky 1-bit graphics dancing around on the outside screen whenever you receive a call or have messages. A screen which, by the way (as another reviewer has noted), displays incoming numbers not in full, but by scrolling. I suppose that's supposed to be advantageous and cool since the numbers are moving.And is there a way to turn all this garbage off? Noooo, there is not! I waded through the 160 page manual and then consulted T-Mobile. The rep told me I should get a phone with fewer features! Ha ha. Features indeed. These seem like small issues, but they aren't--any sensible person will want to stomp this thing after a couple of weeks. What a pity that such an amazing piece of hardware has been ruined by marketing dopes (?), clueless software engineers (?), an art department run by 12 year boys (?).One reviewer says that multiple phone numbers cannot be assigned to a name. This is not the case. You can add as many numbers as you want to each name (the menu system makes this confusing--if you've just entered a new number then Options, Add Entry allows you to add another number. If you are adding a number to an existing name then the sequence is Search, View, Options, Add Entry). The numbers, however, cannot be annotated with anything but the three defaults provided by Samsung (Home, Mobile, Work), but I have found that adequate for my purposes.A final note: While I was amazed that the phone can play chess (how well is hard to say, since even at the lowest level it's too slow), I was not surprised that the board is positioned incorrectly, with the white queen on a black square, and that it's almost impossible to play the game because the designers have opted for a flashy three-dimensional representation which obscures the positions and identities of the pieces.
I've had this phone for 2 weeks now. I upgraded from Motorola V60 and I have to say that this phone is far superior. The reception quality is quite good and so far sound quality is good also. There are some great features to the phone such as the huge 64000 color display and polyphonic ringtones. It is small, (smaller then the v60) very light and sleek. The battery life however is mediocre. I usually have to recharge after about 2-3 days especially when writing text messages since the display is a power hog. The phone sometimes seems to be slow while going into menus from the main screen and there are no sound profiles other than the main one and silent mode. If you don't use predictive text writing then writing can a bit clumsy because of having to constantly switch from predictive mode which can not be disabled as the default. So far the phone is one of the best I have yet used and I highly recommend it. If the size, style and display quality are not that important to you then I would instead recommend the Nokia 6610. For me however, this phone is great!!!
I'll start by saying this review is more about T-Mobile than the phone. I am happy with the phone overall. No problems and the looks and feel are very good. I also have 2 S105's and 2 Sony T68i's in the family. Up until a couple of weeks ago I was very happy with all the phones and T-Mobile. However one morning when I flipped open my S105 the LCD screen was dead. I knew the warranty was 1 yr and it was just about a year old. When I called Samsung the said T-Mobile warranties the phone and I needed to contact them. When I did they said my service was activated on the same day last year and the phone is therefore 1 day past the warranty and not covered. I argued  how can it be beyond the 1 yr warranty period if I bought it on the same day last year. They said "the warranty is for 365 days and not 1 yr". Long story short after numerous phone calls and Samsung intervening they still refused to cover the repairs. I later found my receipt which indicated I actually bought the phone 1 week later so it was clearly within the warranty period. Armed with proof they finally agreed to a warranty replacement. I was then asked if there was any cosmetic damage to my phone.I told them the cheap little plastic cover on the front of the phone has a small crack. They said your waranty is void. WHAT? "Any cosmetic damage to the phone voids your warranty" WHAT? Thats rediculous I said. You mean if theres a scratch on the phone the warranty is void? "Yes, it is considered abuse and voids your warranty." I couldn't believe it. I said a scratch is normal wear and tear and I have never seen a phone that did not have a single scratch. They said they consider it abuse and can deny warranty coverage per the warranty agreement. I told them the lense cracked 6 months ago when I put the phone in my pocket and my keys pressed against it when I squatted down (this is true). I never bothered with it because the phone was still working fine. Besides the lense is so thin and cheap it cracks way to easily and has nothing to do with the electronics going bad. Their only response was telling me I was out of luck and they can deny me coverage for any type of cosmetic damage regardless of whether it has anything to do with the defect or not. I told them up until this point I was very happy with T-Mobile. I switched over from ATT and added 4 addtional phone to my account. For a lousy plastic lense you are willing to lose me as a customer in such a competitive industry? Nothing we can do they said. I told them since they say my 1 yr is up just out of principle I am cancelling all five phones from their plan. They said sorry to hear that  and is there anything else they can do for me. What a joke. Anyway if you sign up with T-Mobile and you can't prevent signs of normal wear and tear on the phone, based on my experience if anything goes wrong with it look for T-Mobile to get out of covering it any way they can.
This phone is definitely worth the money.  It has everything you could want, and it is so simple. i have had no problems with the phone.  the phone's calendar, AIM, GREAT GAMES!!, and the overall easiness to figure out, makes this phone the best phone t-mobile has.  the service is great in NJ! almost 6 bars everywhere i go.  The predictive text is PERFECT for AIM Instant Messages, and great for text messages, it also lets u add words that aren't in the phones dictionary with easy.  Samsung has definitely created a great phone.
Overall: B+The E105 is a great phone for those looking to upgrade from entry level models. If all you need is a phone to make calls and not to take pictures, the E105 is for you. Even without a camera, there is a lot to like about this phone as it has a nice sturdy, modern design and is loaded with great features. The most striking feature about this phone is its gorgeous 65K color screen. There is also a grayscale display on the front that displays the time, date, battery and reception which is also quite useful. Another great feature is the indicator light which flashes a different color when receiving calls or messages. You'll instantly know when you've missed a call or message and you can set the default color to your liking. The reception on this phone is quite good even in buildings and the quality of the sound is clear. The E105 also has a nice selection of games including chess and golf. The battery life is average but understandable considering the screen. If you spend your life on the phone, this could be a drawback. The only real fault I find with this phone is its poor selection of ringtones. Some of them are downright weird and there is no standard ringtone which I prefer. Ringtones today, are generation y's version of elevator music. I cannot remember the number of times I have cringed at the sound of a popular song badly rendered as a ringtone. Sometimes, they are about as obnoxious as the person using them. The selection on this phone does not help the problem.
I purchased the Samsung SGH-e105 to replace my old Nokia 3390. At first I was hesitant to purchase it, because it was not a Nokia, but this phone is much better than my Nokia and it is much smaller. The color screen can display 65000 colors. Most color screen phones can only display 256 or 4056 colors. The menu is easy to understand and everything is pretty straight forward. It also has AIM built into it, like the Nokia 3390. Other features include Polyphonic ringtones (which sound like real music), a huge screen, and an orgnaizer. If you are looking for a good color screen flip phone, then the Samsung SGH-e105 should be your choice.
This is one of the smallest flip phones on the market right now, that's what really caught my eye. I had a Motorola T722i which I was getting very sick of. Most of the Java games that ran on it were extremely slow, because the phone was slow in general. It had major lag moving through menus. The other problems I had with the T722i were a plastic casing that was very flimsy, and not loud enough ringtones.The E105 has extremely solid construction and it is metal, not plastic, phew! It still manages to be far lighter than the T722i. The ringtones on this phone are loud and plentiful. Plus the games on it are awesome and so are the ones that you can download from the web.Only complaints: Like someone else mentioned... Poor charge time. I charge every 1.5-2 days. It doesn't take that long so I'm not gonna whine about that much. Other thing is that would have been nice if they had a camera on this because the color display is so vibrant, but I doubt they could have managed it in a phone of this size. And the last thing... my T722i's screen was perfectly visible in sunlight, this screen can't be seen if you are directly under the sun very well.All in all a great phone and well worth the money.
I've had this phone for a week now, and I have yet to have a single problem with it.  It comes with just the basic features (color screen, polyphonic rings, etc.) without all the frills of some phones (cameras, video recorders, radios, etc.)  This phone is great for someone who wants to upgrade from that old green screen to something a little nicer but doesn't want to be out a fourtune on a phone with features that you have to spend a fortune to even use (picture messaging ring a bell?).  The games are nice, and the rings are loud and very audible.  The reception is great, and the price simply can't be beat.  I would definitely recommend this phone to anyone with a listening ear.....I'm already trying to spread the word and get more of my friends updated into the 21st century.
I've had the e105 for about 2 weeks now and I must say it's one of the best phones I've owned.  The included ringers are truly embarrassing to play in public, but it's easy to download new and free ringtones with the free WAP access that T-Mobile includes. The rings are very loud though, and the sound quality is superb... my ringer is currently a song with the voice and all! The sound quality is great, but I guess that depends on your location and service in your area.  T-Mobile includes free basic WAP browsing which I use everyday on this phone, and for the people who can't access their favorites in T-Zones...all you have to do is hold down the pound button and your favorites will pop up. The battery life is mediocre, but I can't really complain since I'm always making a call, playing games, or browsing the web.  Overall this is an excellent phone, the people who complain about this phone really need to do their research before they blab, I downloaded new games, backgrounds, and ringtones for FREE.
pros:-cheap-good rf-good battery lifecons:-no bluetooth (cars will have bluetooth options now where your phone call rings in thru your car's speakers and the caller id shows up on a display in your dash and you can dial from your steering wheel, all while the phone is still in your pocket, ie, the 2004 Acura TL)-no voice dialing (if you're not going to have bluetooth, at least have this??!)-styling looks cheaper than its predecessor, the s105-text input is cumbersome, very non-intuitive-not a TFT display, horrible to read in sunlight-phone will *NOT* vibrate and ring at the same time! uhh duh?Overall, this would be a great phone for teenagers and young people but not for working professionals.
This is a nice little phone with a good color screen but the IR port does not work with any device other than a computer running Windows XP or 2000.  You cannot pass info from another phone or from a handheld device into the E105 thru the irda port.  And you cannot sync your phone with Outlook or any other PIM you may use, you can only copy the information into Samsung's EasyGPRS program for downloading into your phone.  And the last problem I have with it is that each number is a seperate entry.  You cannot have more than one number associated with a person without creating a seperate entry for each number.Nice phone but the functionality is very old school.  It would be nice if they could have a modern software package with the modern phone.
I am an infrequent cell phone user so after a year of not having a cell phone, I decided to take the plunge yet again.  After a lot of research I decided to get this Samsung phone.  When I received it, I was very pleasantly surprised.  The phone was much smaller than the picture indicates, it fits in my jeans pocket with no problem!  So far, I've had it about a week and the phone is pretty clear, no problems connecting.  I've even downloaded some free ring tones.  So far very happy, no-frills service, I received the phone, turned it on and was ready to make calls immediately.
I just received my E105 the other day and I must say that I'm more than impressed.  It is much smaller than it looks in the pics and has steel casing.  I was always worried about dropping a flip phone and doing extensive damage....nothing to worry about with this baby.  The 65,000 color LCD is bright and clear!  There aren't the best song selections for ringtones, but the polyphonic sound is incredible and loud.  If you are looking for a phone with good reception, a stylish look, and a colorful screen this is the one for you. It doesn't have tons of features like some of the other Samsung models, but who uses all that crap anyway.  I'm very satisfied!
I got this replacing a samsung a460..and my faith in samsung has been made stronger...Almost the same functionality as the a460, with a lil bit more, and of course, a color screen added. Got wot i expected and am very happy with the phone. Ppl i spoke to said my voice comes across very clear...probably clearer than my earlier device. All in all, very happy with this buy. And forgot to mention the parameter, which was the USP for me - the weight. The thing comes at a mere 2.8 oz and thats real neat. Probably one of the lightest devices on show today. It doesnt come with a camera and all that jazz, but if you dont need those, very nice phone.CONS****It seems to have a few delays in operation. Sometimes very slow to respond to keys, and at times, the Phonebook tells me it is "Initialising", when I try to use, and keeps shwing that message fopr quite some time.
With the exception of not being bluetooth compatible this phone is the best.  Small size and good features mixed with some helpfull additions like an organizer and alarm modes makes this a capable little phone.I second the complaint about the ring tones.
This phone is tight.  The guy who gave it 1 star should realize that this phone is probably geared toward the younger crowd, not old people who have trouble with electronics because it is packed with stuff with lots of options.  I had a Samsung sph-a460 before, and I was happy with it.  But now I realize what I've been missing out on.  Definately, this phone is for younger people who download music, text, etc... I can't imagine a 50 year old business man using a color phone with blinking lights.  The only reason I didn't give this 5 stars is because it only has speed dialing for 10 (I believe) people.  My other samsung phone had speed dialing for each number.  But damn, this phone has 1,000 spaces of storage + 250 with the SIM which is included.  Seriously, I can add all of my friends and their mothers.  Speaking of Call clarity, this isn't Sprint PCS (which I had before), but I'm certain that it's better than At&t; and Cingular.  The phone itself is very slim, and I was surprised that it came with a holster and a nice earpiece, not those cheap ass ones.  And there are a bunch of rebate offers right now.  So far, I'm happy.  I know I won't have clarity that of Sprint PCS.  If you need a phone for business purposes, I think Sprint, Nextel, and Verizon are the way to go.  They have professional phones.  But if u gota be laced up with the hottest ish out there right now, get this.  (If you didn't understand the last sentence, you're most likely older, so don't get it.)
besides everything written before me, the biggest negative for this phone is that the rings are horrible.  If you want a song, then great,  if you want a ring, you're out of luck.  The only option is the t-mobile melody, outside of that not a single simple ring.The makers seem to forget all about people who want a simple phone that rings and makes phones calls.  All the other options are fun and games, but completely worthless in a phone.
This phone is a beauty.I like each and every feature of this...especially the colored screen and the flip cover.I bought this phone when it was available for around 50 bucks with the T-mobile plan. But now they are giving back the same amount and thats pretty cool. Its so small and lite, you can't feel it...go for it guys...
I've had this phone for a little under two weeks now and so far it's been good. i can't complain. I havn't been able to figure out how to decrease the size of the text when dialing or how to assign ring tones to individuals.. but it's still new.. i'll take any suggestions also.
I don't know about all the other "professionals" who think this phone is bad.......but seriously, if you want normal ringtones you should have bought a "monophonic" phone instead of a "polyphonic". DUH.........Well, I personally think this phone is the most reliable/cheapest phone there is on the market today........and plus its color.......who can beat that?........The only problem is that the phone doesn't vibrate and ring at the same time.......it vibrates 3 times first, then rings.......which is real annoying after awhile..................but besides that, this phone is perfect.
We bought two of these phones on the family plan and love them.  They are loaded with features that are easy to use once you read the instructions...which by the way, are as easy as a 2nd grade reading book.  Congrats to the Samsung industry for not only making a great, fun, easy to use cell phone, but providing an easy to read instruction manual.Buy one...or two...you won't regret it.
I bought this phone a few weeks ago, and have been frustrated ever since.  Besides the bad sound, it adds a hum to the voice.The menu system is extensive and therefore ridiculous to use.  Too many options to make this phone useable.Ring Tones?  great for kids, but there is no simple standard ring tone that sounds like a phone.  I have contacted customer support on a few occassions, and no one has given me any direction as to where to find a simple ring.  The only option available is the T-Mobile melody that you hear on their commercials.  They dont seem to realize that not everyone wants to play music.  I cant find, download or buy a simple ring.I'm counting the days till my contract expires.
I've only had this phone a day--my simple, reliable former phone was stolen and had to be replaced--and doubtless other problems will arise with it.  But I've already experienced enough to be frustrated.Sound quality is extremely poor compared to my old (and much cheaper!) phone.  This phone adds a buzzing or humming sound.The display on the cover is so small that it can't show an entire number; the caller's number scrolls across, with a long space in between appearances.  So it's hard to tell what the incoming number is.There are no "normal" rings, only irritaing music that sounds like it was made on a '70's Cassio Keyboard for a slightly quirky porn film.  The closest to a standard ring is the T-Mobile advertisement jingle.  (Other reviewers seem to think that this is a plus; but why couldn't there be an option for those whose sense of dignity is offended by carrying a machine that blasts the Mexican hat dance?)The menu system is frustratingly byzantine, seemingly designed to be counter-intuitive.The casing is cheap and flimsy.Rather than create a simple, usable interface, the programmers have chosen to justify their existence by souping everything up; perhaps they hoped that no one would notice how repellent the display graphics are as long as the display is filled with twirling images.  Unfortunately, that just draws attention to the hideousness of it all.
THIS IS A GREAT PHONE, I DONT KNOW WHAT YOU PEOPLE OUT THERE ARE TALKING ABOUT!!!!AND....MATT HOFFMAN, YOU CAN ASSIGN RINGTONES TO INDIVIDUALS (UP TO 10 PPL)
ive used his phone. it works.
This phone is great. It's small and compact. Nice and light. I love the rings and its not complicated. Everything is nice and simple.
this phone is great. im a 14 year old kid, and we all bout style, so when we have a small decent phone, its all good. Aim is a great feature, cause 99% of kids have it nowadays.. and yea, hte ring tones are bomb.. only drawback is that you cant preview the tones first.. great customization though.. the vibe/ring is really annoyting at times.. really annoying.. i thought it would be like the nokias, where it actually rang and vibrated.. but its all good, the sound quality is loud enough.. haha, get this phone, its the bomb!
i just got this phone. before i had a nokia and i must say the Samsung e105 is very easy to use and its nicer. I love this phone i keep it with me alllll the time
This phone has been a tinny, pooryly made pain-in-the-neck since I got it.  The fact that so many people have rated it highly means that either Samsung has a team skewing the ratings or all the ratings are by teen-agers: I can't imagine anyone else could be happy with this thing. It's the worst case of style (and shoddy style at that) over substance that I've ever seen.  And I totally agree with the reviewer who complains about the menu and unusable cover display.
I've been a Nextel customer for about a year, and the first thing I noticed about the new i730 is the size. It's thin! Much improved over my old phone. Looks good, and feels light. And improvements in size and weight haven't been made at the expense of features. The color display is jaw-dropping, very bright and clear. And I love the GPS. I know this has practical benefits, and I appreciate that, but right now I like this feature because it's cool and fun. Did I really need the GPS satellites to locate my position on Earth while I was at lunch today? No, but I did it anyway, and my lunch-mates were impressed.One of the features the Nextel sales guy pushed was the fact that this phone has the latest Java technology. I haven't fully explored, but look forward to checking it out on my next flight. There are all sorts of productivity helpers and games to check out. And, this phone has "airplane mode" like my Blackberry, which lets you turn off the wireless part, while still being able to play games or run other java tools -- perfect for killing time while in-flight. Also on my list to do when I have a minute is to assign unique rings to a few people in my phone book -- that way I don't have to look at the screen to know if it's someone I need to talk to or not.I've owned this phone for less than a month, and love it. I've been happy with Nextel, after having been with other carriers, none of them have the combination of service and features that Nextel offers. Nextel's walkie-talkie service is amazing -- fast, clear, and, again, very cool. Great service, and now a great phone -- I'm definitely a happy customer. 5 stars for this one.
I have been using this phone for several days now and I must say that its very light and sleek.  Looking at the front, you will first you notice the motorola emblem, which lights up like a disco light when you assign musical ringtones to it.  I would have preferred a status light instead.  The front LCD display can be perfectly seen and isnt too small or too large.  When you open the phone, you notice how much more sleeker it is than nextels last flagship phone, the i95.  It weighs a mere few ounces and feels great to carry around.  The 65k lcd display delivers crisp color and is very bright.  I wish it was bigger though.  The keypad is backlighted with a sensor and a very nice blue hue which is pleasant to view at night.  The button arrangement is good, no problems here.  The back of the phone has the speaker on it.  People find it annoying that the speaker is located in the back but I understand why Motorola did it.  Now I can finally hear my phone ring when it's on my clip!  On the side of the phone you have the usual PTT buttons which are black and a black antenna.  The phone can hold upto 600 contacts, which is more than enough for anyone.  One touch PTT is a new feature which can help anyone.  IT has an arsenal of java apps and many more that are available for purchase.  The phones interface is quite easy and straight forward.  I have yet to have any wrong buttons pressed, which is a good thing.  The phone also has many color profiles which will fit any mood.  What interested me the most was the GPS system on the phone, which will tell you where you are in the world, a very cool feature.All in all, this phone is wonderful and worth every penny.  Nextel has done it again.  I would recommend this phone to anyone 16 and up.  Thanks for reading!
This is Nextel's slickets phones. It fits in your pocket (finally), has a great color screen and 600 contacts.Also it comes with TELENAV GPS which beats any in-car GPS navigation system. It talks to you over the speakerphone and tells you when to turn. It also has maps, yellow pages and a lot more.I just wish that the battery life was a bit longer.
I've owned the i730 for about 2 weeks, having bought it to "upgrade" the i90c I've used for over a year.  The i90c was a fine phone, a bit bulky and the batter life was terrible (even with an upgraded 750mAh battery), but it's incredible call clarity and loud speakerphone was enough to make me overlook its shortcomings.  So, I figured the i730 would only be better than i90c, right?  Not necessarily.My biggest complaint with the i90c was battery life, and sadly, Motorola still hasn't solved the problem.  The i730 is a slight improvement, but if you use the phone a lot like I do, be prepared with car chargers and backup batteries.  The i90c was also bulky as it had a hump on the back to accomodate the battery.  While the 730 is sleek (no hump), it still is essentially the same size and thickness as the i90.  Weight is nearly identical.  Call clarity with the i730 is comparable to the i90c, which is good.Speakerphone, here's my biggest complaint.  With the i730, Motorola moved the speakerphone to the back of the phone (it faced the front on the i90c).  This makes no sense to me.  Others have said they like this design because they can hear people when the phone is clipped to their belt, but when I use the speakerphone, I generally place the phone down on a surface.  As a result, the sound is muffled coming from the speakerphone.Another complaint is the location of the buttons.  First, the power button is nestled between other important buttons and is not easily found in the dark (unlike the i90c).  Call and end buttons are also reversed from the i90c.  While I'm sure with enough use I'll get familiar with the location, the reversal of buttons from the 90/95 models has me frustrated.There are good things I like about the i730, such as the flip activation control, which allows me to place a call on speakerphone and close the phone without disconnecting.  I also like the clean appearance (silver), and the blue backlight makes using it at night easy.  In sum, it's a decent phone, but coming from the i90c, I expected better considering the hefty price tag.
When the i95 came out, i thought it was amazing.  I thought it was durable and easy to use.  Then i got the i730 and I am very happy with it.  A couple of my favorite features is that it's alot thinner and half of the size of the i95.  The speaker in the front of the phone lights up for an incoming call.  It has very precise color.  The only problem i had when i first used it was the bottons are close when choosing things from the menu or the scroll up.  I got used to it, in like 3 days.  Now, i am loving this phone.  By far the best phone that Nextel has come out with.  I heard they are getting one w/ a camera soon but i dont think i want to change, this phone is perfect!!!
So I've had my new I730 for a month or so now, and here's the GOOD and the BAD about this phone.The Good1. Best of the Nextel phones.  A lot of Nextel's phones are clunky and have bad form factors.2. Backgrounds.  There are a number of appealing backgrounds such as a sailboat and sunflower that are quite nice.3. This phone is tough and feels well-constructed.  I feel like I could drop it on cement and nothing would happen.4. Speaker-phone.  The speaker-phone is loud and clear.  Direct Connect (Push to Talk) is great too.The Bad1. Poor user-interface.  Motorola has a long way to go before they can match up to the usability of Nokia's.  Also, the icons are small, poorly drawn, and have no labels until highlighted so you can't quickly scroll to the needed icon.  So, you waste time trying to get to what you need to use.2. Doesn't recognize shortened numbers with Caller ID.  My previous phones would recognize numbers even if they had missing area codes or, a calling card sequence before it, but this phone cannot do this.  The solution to this is to record all number combinations under the same name, but this is tedious.3. Limited ringtones.  Motorola really needed to put in some better sounding ones in their phones.  Just because you can dowload more doesn't mean that they shouldn't have done a better job of the initial ones.  They sound just plain horrible.4. Small screen.  I think I was spoiled because my previous cell phone had a large screen and clear fonts.  This Motorola has a tiny screen.  Granted, other cell phones also have small screens, but the phone doesn't make use of the full potential viewable screen space on the front part of the flip.5. Lots of interference.  When I use the phone in front of my computer.  The screen begins to get all flickery and the speakers begin to do strange drumbeat sounds.  I wouldn't be surprised if this phone has higher radiation than other phones.  My previous cell phones never did this.  As a result, I can't use my phone directly in front of my computer.Bottom line: I had to get this phone because of direct-connect, but given the choice, I would use a different phone.
The good:(1) Awesome Speakerphone.(2) Bright display.(3) GPS enabled.(4) Thinner and lighter than any previous Nextel I've seen.The bad:(1) No bluetooth.(2) Only 3 polyphonic ringtones are included.(3) Only 3 wallpapers are included.(4) No games included, only demos.(5) No Alarm Clock function. (What'd they just forget?)(5) No computer connection cable. They want $30 for this cable -- Should be a $5 item! (No, should be included!)(6) No data services at all (no new ringtones, no text messages, no addressbook updating, etc) without an added monthly data fee.(7) That antennea on the corner still looks silly and snags my clothing...Given that most of us own Nextel phones for work, I can understand leaving out some of the fun features Nokia and Samsunginclude, but cutting all of the nice-to-haves on the top of the line phone seems, well, cheap, like the iDen service is design to bleed extra money from the customer.Bottom line: If you are Nextel loyal this phone *is* better than what you are carrying now. But, If you are considering picking up Nextel as a carrier, I'd pass, other carriers are more competitive on price and have a wider variety, and better phones.
This is my first foray with Nextel. I have had service with cingular(w/Motorola accompli 009),verizon(w/Motorola t720)and a short-lived stint with t-mobile(w/motorola v300). Out of all the phones and services,Nextel is the best for me. The phone is fantastic. Beautiful color screen and a very nice platinum outer finish. Its bigger than my previous phones, but it fits nicely to my ear and the phone feels more durable. I was please to find out this phone has a one touch direct connect, which is a real cool feature. The speaker is real loud-much louder than my boyfriends i95cl, and I can honestly say the earpiece has better reception (RF). Also the telenav feature is a very nice touch,I recently moved to Seattle and its helped me out tremendously. This phone is also feature-rich(JAVA,airplane mode,voice notes,datebook,the ability to give diffrent ringtones on your contacts etc..) I highly recommend this phone to anyone, but I wish it had a status light.
I have recently purchased the i730 phone from Amazon.  I have had the phone for about two weeks now.  As a concerned buyer I was a little leery about purchasing a phone online, but I could not be happier with my new phone.  I have had many phones in my short life span of 18 years, and let me tell you I know a good phone when I see one.  I usually do not buy phones that are made by the Motorola company, but this one is different.  This phone will fit the needs of all consumers  no matter what they need it for.  It is one of the best out there in terms of style, features and ease of use.  When I first took the phone out of it's packaging I could not help but to take a double look at its sharp, glossy, and  silver appearance.  As my fingers grazed the slender surface of the phone my eyes went in for a closer examination.  I first turned the phone on its side where I immediately noticed the slim design, which is a step up from the bulkier i95cl phone.  My fingers then slid over the buttons on the side and top of the phone, which are standard for all Nextel phones.  Once I reached the bottom of the phone I saw a flip, which I opened only to see more unique designs.  I first noticed the crystal clear color screen once the flip was opened.  I then slid my fingers down the sides of the screen to where all the buttons were held.  I then mentally noted the beautiful blue illuminating glow of the key pad, which will turn any head at night.  The buttons on the i730 are ordered very simplistically.  All the important buttons can be accessed at the top of the key pad in an oval shape, while the simple ones only used to dial numbers are below.  The positioning of these buttons are essential for all good phones.  A phones set up can be one of the most important selling point of it.  The same applies for the i730.  I know when I personally search for a phone I not only buy for style, but also for overall set up and ease of the phone.  I personally believe that the set up of  buttons on a phone are a very important part to any phone.  Whenever I'm driving in my car I know for a fact that I do not look down and find the button before I press it, but rather I usually find it through feel and general knowledge of where the button is located.  Especially if I'm driving on the expressway where one false glance away from the road can cause a fatal accident.  For this reason I shop for phones where the buttons are easy to find and push, such as the i730.  When I get a call on the expressway all I do is open the flip and push the talk button, which is very easily accessible right on the upper left hand side of the phone.  I'm sure a lot of people with cell phones go about finding buttons the same way as I do while driving.  So naturally it helps to have important buttons such as Talk, End, Menu and the power button in a central location in an attempt to minimize the search for a button through touch.  The i730 is a big step up from its predecessor the i90c in terms of features and overall style.  The i90c is a good phone, but it had issues that needed to be improved.  When the i90c is on the belt clip the sound gets muffled and is hard to hear.  The i730 improved on this problem by creating a not only a speaker on the front of the phone, but one on the back as well, so that the sound will no longer be muffled.  The speaker on the front of the phone even has a hole so the customer is able to talk to another person, while the clip is still attached to the phone.  That is what I call convenience.  The i90c also had a very common outside color too it, while the i730 has a new glossy silver coat.  By far the biggest difference between these two phones is not the color or the placement of the speakers it is the vast features.  The i730 is Nextel's first phone with the amazing Global Positioning System or (GPS).  This system uses satellites orbiting the Earth to determine the approximate geographical location of the phone.  To some this may be a very high tech and pointless feature, but it is actually very easy to use and if a person travels a lot it could really come in handy if they get lost.  The phone book of the i90c is a mere 250 capacity, while the i730 holds up too 600 entries!  The i730 also has  flip activation, which means you can answer a call when the flip goes up.  The ability is also there to shut off flip activation so you can call someone and close the flip without disconnecting the call.  The feature I like the most that the i90c did not have is the voice activated dialing.  This can really come in handy when driving and not being able to select the person from the phone book.  I would highly recommend this phone to anyone.  It is not only one of the newest out there it is one of the best out there.  It is one of the most well rounded phones and so far it has worked perfectly for me and I'm sure that it will do the same for you!
The i730 is quite a phone. Like all phones, there are things that may seem quirky. If you are looking for a head-turning, feature-packed, really-cool phone... this is definitely worth considering. WARNING: It does take a few days to figure out how to use it all.
When I first took the phone out of it's packaging I could not help but to take a double look at its sharp, glossy, and silver appearance. As my fingers grazed the slender surface of the phone my eyes went in for a closer examination. I first turned the phone on its side where I immediately noticed the slim design, which is a step up from the bulkier i95cl phone. My fingers then slid over the buttons on the side and top of the phone, which are standard for all Nextel phones. Once I reached the bottom of the phone I saw a flip, which I opened only to see more unique designs. I first noticed the crystal clear color screen once the flip was opened. I then slid my fingers down the sides of the screen to where all the buttons were held. I then mentally noted the beautiful blue illuminating glow of the key pad, which will turn any head at night. The buttons on the i730 are ordered very simplistically. All the important buttons can be accessed at the top of the key pad in an oval shape, while the simple ones only used to dial numbers are below. The positioning of these buttons are essential for all good phones.A phones set up can be one of the most important selling point of it. The same applies for the i730. I know when I personally search for a phone I not only buy for style, but also for overall set up and ease of the phone. I personally believe that the set up of buttons on a phone are a very important part to any phone. Whenever I'm driving in my car I know for a fact that I do not look down and find the button before I press it, but rather I usually find it through feel and general knowledge of where the button is located. Especially if I'm driving on the expressway where one false glance away from the road can cause a fatal accident. For this reason I shop for phones where the buttons are easy to find and push, such as the i730. When I get a call on the expressway all I do is open the flip and push the talk button, which is very easily accessible right on the upper left hand side of the phone. I'm sure a lot of people with cell phones go about finding buttons the same way as I do while driving. So naturally it helps to have important buttons such as Talk, End, Menu and the power button in a central location in an attempt to minimize the search for a button through touch.The i730 is a big step up from its predecessor the i90c in terms of features and overall style. The i90c is a good phone, but it had issues that needed to be improved. When the i90c is on the belt clip the sound gets muffled and is hard to hear. The i730 improved on this problem by creating a not only a speaker on the front of the phone, but one on the back as well, so that the sound will no longer be muffled. The speaker on the front of the phone even has a hole so the customer is able to talk to another person, while the clip is still attached to the phone. That is what I call convenience. The i90c also had a very common outside color too it, while the i730 has a new glossy silver coat. By far the biggest difference between these two phones is not the color or the placement of the speakers it is the vast features. The i730 is Nextel's first phone with the amazing Global Positioning System or (GPS). This system uses satellites orbiting the Earth to determine the approximate geographical location of the phone. To some this may be a very high tech and pointless feature, but it is actually very easy to use and if a person travels a lot it could really come in handy if they get lost. The phone book of the i90c is a mere 250 capacity, while the i730 holds up too 600 entries! The i730 also has flip activation, which means you can answer a call when the flip goes up. The ability is also there to shut off flip activation so you can call someone and close the flip without disconnecting the call. The feature I like the most that the i90c did not have is the voice activated dialing. This can really come in handy when driving and not being able to select the person from the phone book.I would highly recommend this phone to anyone. It is not only one of the newest out there it is one of the best out there. It is one of the most well rounded phones and so far it has worked perfectly for me and I'm sure that it will do the same for you!To sum up this is simple to say this is The VERY BEST CELL PHONE MONEY CAN BUY !
The pricing on this phone is out of hand particularly if you are currently a Nextel customer.  As another reviewer indicated, Nextel is unfair to current subscribers.  While every other wireless company, will simply extend your contract and give you a great deal on a new phone, Nextel only provides a price break if you are a new customer (a $150 break no less.)  The phone is selling on eBay far beyond the price that even Nextel is charging with hundreds of people vying for the i730's at auction.  If I were a current Nextel subscriber, I would simply let my current contract run out and sign up elsewhere on the sheer basis of poor customer service.  Not to mention that they are not competitive with their minutes or pricing on their plans.  If I were a business owner, I would consider switching to a better service provider with better rates because it will always cost a fortune to upgrade the phones.  The company would be stuck with the same phones for the entire length of the contract, which would make the phones outdated and unuseful.
This is the coolest phone.  You can use it like a walkie-talkie instantly across the United States.  It has saved me so much time of calling, waiting for the phone to ring and making pleasant conversation.  Gets to the point.  Gets things done.  I traded in my i90 for the i730.  You can go to the Motorola site and download .wav file ring tones that sound like a real voice.  This is a great business tool, but it's also fun to use.  Get it.
Not only does Nextel have far and above the BEST service in the wireless industry, but now they've unleashed the BEST phone with the new i730.  Compact, sleek and amazingly durable, the i730 is Nextel's most feature-loaded phone yet.  I've been a Nextel customer for 2 years and would never consider another carrier (used to be with AT&T, Verizon and CellularOne (now Cingular)).  Their coverage is far-superb and I've never had a dropped call!  If you loved the i90c or i95cl, the i730 is going blow your mind.  Like U2's unleashing of 'All That You Can't Leave Behind', just when you think Nextel couldn't possibly get any better, they 'brought da noise AND da funk' with the i730!
The i730, for many reasons, is the finest phone I have ever owned. I bought this phone hoping it would have everything my i95cl has...and found out it has MUCH more. The TeleNav application, pre-loaded, allows me to fully utilize the GPS service in this phone. The ease of use and ability to simply download ring tones and games make it simple to customize my phone. Many others have commented on the "disco lights" on the outside when my phone goes off in a darkened room.The BEST...no better words describe it.
And it was pretty much worth it (if you sign the plan and get the phone for $250). Otherwise it is a little pricey. The gain was enough to make me feel good about buying it though, and my plan was up anyway so no remorse there. It's difficult to tell from this picture if your i95 is any bigger - but it is less bulky. The features are the same but a little better. And of course GPS is nize.
This phone should be sold to existing customers as well.
I have to say that this is a great phone and the Nextel service is great also.As for the review from the moron from Denver You need to have used it and the service before you open your mouth and make a fool of your self.People that review something and not have a clue just goes to show that stupid people should not breed.  I have had the I90c,I95cl and the i730 and the 730 is great as for a alarm buy a clock if you need a alarm.The screen is a little smaller but the brilliant color makes up for it,the sound is as good as the other phones I have had.  As for service I have had every carrier that is in the state of Colorado and Nextel is the best and for any one who is thinking of Verizon for push to talk well it sould be push to wait.If you want the best this phone and service is the best.
The good:(1) Awesome Speakerphone.(2) Bright display.(3) GPS enabled.(4) Thinner and lighter than any previous Nextel I've seen.The bad:(1) No bluetooth.(2) Only 3 polyphonic ringtones are included. (you can buy more)(3) Only 3 wallpapers are included. (you can buy more)(4) No games included, only demos. (you can buy more)(5) No Alarm Clock function. (What'd they just forget?) USE THE DATEBOOK THERE IS AN ALARM ALREADY THERE.  THE PHONE HAS AN ALARM, ITS IN THE DATEBOOK, YOU CREATE AN EVENT, AND HAVE THE PHONE REMIND YOU OF IT, HENCE, IT IS CALLED AN ALARM IN THE PHONE.(5) No computer connection cable. They want $30 for this cable -- Should be a $5 item! (No, should be included!) SHOULD NOT BE INCLUDED, AS YOU ONLY NEED IT IF YOU ARE USING THE PHONE AS A MODEM.(6) No data services at all (no new ringtones, no text messages, no addressbook updating, etc) without an added monthly data fee.  EVERY COMPANY MAKES YOU PAY FOR DATA SERVICES, NOT ONE PHONE GIVES YOU DATA FOR FREE, THE SERVICE PROVIDERS CHARGE YOU FOR IT.  NEXTEL DATA USE DOES NOT USE MINUTES OR CHARGE FOR DATA SENT OR RECIVED(7) That antennea on the corner still looks silly and snags my clothing...
I was hoping motorola would come out with a phone with an alarm clock with a simple snooze, not yet, still have to go through a 10 step process through the date book, common give me a break.  The screen is now in a 65k color display, but they have shrunk the screen so you can hardly see anything.  The buttons are extremly bulky and don't interface well with the tiny buttons on the screen you can hardly see.  I'm getting rid of Nextel all together because they definetly have the most unfriendly, non-functionability phones on the market.
